/* automatically generated by rust-bindgen 0.63.0 */

pub const _GLIBCXX_CSTDINT: u32 = 1;
pub const _GLIBCXX_CXX_CONFIG_H: u32 = 1;
pub const _GLIBCXX_RELEASE: u32 = 10;
pub const __GLIBCXX__: u32 = 20210408;
pub const _GLIBCXX_HAVE_ATTRIBUTE_VISIBILITY: u32 = 0;
pub const _GLIBCXX_USE_DEPRECATED: u32 = 1;
pub const _GLIBCXX_EXTERN_TEMPLATE: u32 = 1;
pub const _GLIBCXX_USE_DUAL_ABI: u32 = 1;
pub const _GLIBCXX_USE_CXX11_ABI: u32 = 1;
pub const _GLIBCXX_INLINE_VERSION: u32 = 0;
pub const _GLIBCXX_USE_ALLOCATOR_NEW: u32 = 1;
pub const __GTHREAD_HIDE_WIN32API: u32 = 1;
pub const NOMINMAX: u32 = 1;
pub const __USE_MINGW_ANSI_STDIO: u32 = 1;
pub const _GLIBCXX_HAVE_DOS_BASED_FILESYSTEM: u32 = 1;
pub const _GLIBCXX_NO_IOCTL: u32 = 1;
pub const _GLIBCXX_LLP64: u32 = 1;
pub const _GLIBCXX_USE_WEAK_REF: u32 = 0;
pub const _GLIBCXX_THREAD_ATEXIT_WIN32: u32 = 1;
pub const _GTHREAD_USE_MUTEX_INIT_FUNC: u32 = 1;
pub const _GLIBCXX_USE_CRT_RAND_S: u32 = 1;
pub const _GLIBCXX_CPU_DEFINES: u32 = 1;
pub const _GLIBCXX_FAST_MATH: u32 = 0;
pub const _GLIBCXX_USE_FLOAT128: u32 = 1;
pub const _GLIBCXX_HAVE_BUILTIN_HAS_UNIQ_OBJ_REP: u32 = 1;
pub const _GLIBCXX_HAVE_BUILTIN_IS_AGGREGATE: u32 = 1;
pub const _GLIBCXX_HAVE_BUILTIN_LAUNDER: u32 = 1;
pub const _GLIBCXX_HAVE_BUILTIN_IS_CONSTANT_EVALUATED: u32 = 1;
pub const _GLIBCXX_HAVE_ACOSF: u32 = 1;
pub const _GLIBCXX_HAVE_ACOSL: u32 = 1;
pub const _GLIBCXX_HAVE_ASINF: u32 = 1;
pub const _GLIBCXX_HAVE_ASINL: u32 = 1;

pub type std_basic_string_const_pointer = u8;
pub type std_basic_string_iterator = u8;
pub type std_basic_string_const_iterator = u8;
pub type std_basic_string_const_reverse_iterator = u8;
pub type std_basic_string_reverse_iterator = u8;
pub type std_basic_string___const_iterator = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string__Alloc_hider {
    pub _address: u8,
}
pub const std_basic_string__S_local_capacity: std_basic_string__bindgen_ty_1 = 0;
pub type std_basic_string__bindgen_ty_1 = i32;
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union std_basic_string__bindgen_ty_2 {
    pub _bindgen_opaque_blob: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_base {
    pub _address: u8,
}
pub type std__List_base__Tp_alloc_type = u8;
pub type std__List_base__Tp_alloc_traits = u8;
pub type std__List_base__Node_alloc_type = u8;
pub type std__List_base__Node_alloc_traits = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_base__List_impl {
    pub _address: u8,
}
pub type std__List_base_allocator_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_list {
    pub _address: u8,
}
pub type std_list__Base = u8;
pub type std_list__Tp_alloc_type = u8;
pub type std_list__Tp_alloc_traits = u8;
pub type std_list__Node_alloc_type = u8;
pub type std_list__Node_alloc_traits = u8;
pub type std_list_value_type = u8;
pub type std_list_pointer = u8;
pub type std_list_const_pointer = u8;
pub type std_list_reference = u8;
pub type std_list_const_reference = u8;
pub type std_list_iterator = u8;
pub type std_list_const_iterator = u8;
pub type std_list_const_reverse_iterator = u8;
pub type std_list_reverse_iterator = u8;
pub type std_list_size_type = u64;
pub type std_list_difference_type = u64;
pub type std_list_allocator_type = u8;
pub type std_list__Node = u8;
pub type std_list___remove_return_type = u8;
pub type std_integral_constant_value_type = u8;
pub type std_integral_constant_type = u8;
// extern "C" {
//     #[link_name = "\u{1}value"]
//     pub static std_value: _Tp;
// }
pub type std_true_type = u8;
pub type std_false_type = u8;
pub type std___bool_constant = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_identity {
    pub _address: u8,
}
pub type std___type_identity_type = u8;
pub type std___type_identity_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___or_ {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___and_ {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___not_ {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___success_type {
    pub _address: u8,
}
pub type std___success_type_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___failure_type {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___failure_type() {
    assert_eq!(
        ::std::mem::size_of::<std___failure_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___failure_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___failure_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___failure_type))
    );
}
pub type std___remove_cv_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_void_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_void {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_integral_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_integral {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_floating_point_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_floating_point {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_array {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_lvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_rvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_member_object_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_object_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_member_function_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_function_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_enum {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_union {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_class {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_null_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_null_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nullptr_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_fundamental {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_object {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_scalar {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_compound {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_member_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_pointer {
    pub _address: u8,
}
pub type std___is_one_of = u8;
pub type std___is_signed_integer = u8;
pub type std___is_unsigned_integer = u8;
pub type std___is_standard_integer = u8;
pub type std___void_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_referenceable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_const {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_volatile {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivial {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copyable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_standard_layout {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pod {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_literal_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_empty {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_polymorphic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_final {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_abstract {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_signed {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_unsigned {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_array_known_bounds {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_array_unknown_bounds {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___do_is_destructible_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_destructible_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___do_is_destructible_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___do_is_destructible_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___do_is_destructible_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std___do_is_destructible_impl))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_destructible_impl {
    pub _address: u8,
}
pub type std___is_destructible_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_destructible {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___do_is_nt_destructible_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_nt_destructible_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___do_is_nt_destructible_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___do_is_nt_destructible_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___do_is_nt_destructible_impl>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___do_is_nt_destructible_impl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nt_destructible_impl {
    pub _address: u8,
}
pub type std___is_nt_destructible_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_constructible_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_constructible {
    pub _address: u8,
}
pub type std___is_nothrow_constructible_impl = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nt_assignable_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_assignable_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___do_is_implicitly_default_constructible_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_implicitly_default_constructible_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___do_is_implicitly_default_constructible_impl>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(std___do_is_implicitly_default_constructible_impl)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___do_is_implicitly_default_constructible_impl>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___do_is_implicitly_default_constructible_impl)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt45__do_is_implicitly_default_constructible_impl6__testEz"]
    pub fn std___do_is_implicitly_default_constructible_impl___test() -> std_false_type;
}
impl std___do_is_implicitly_default_constructible_impl {
    #[inline]
    pub unsafe fn __test() -> std_false_type {
        std___do_is_implicitly_default_constructible_impl___test()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_implicitly_default_constructible_impl {
    pub _address: u8,
}
pub type std___is_implicitly_default_constructible_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_implicitly_default_constructible_safe {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_implicitly_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_has_virtual_destructor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_alignment_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_rank {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_same {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_base_of {
    pub _address: u8,
}
pub type std___is_convertible_helper_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_convertible {
    pub _address: u8,
}
pub type std___is_array_convertible = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_convertible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_const {
    pub _address: u8,
}
pub type std_remove_const_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_volatile {
    pub _address: u8,
}
pub type std_remove_volatile_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_cv {
    pub _address: u8,
}
pub type std_remove_cv_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_const {
    pub _address: u8,
}
pub type std_add_const_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_volatile {
    pub _address: u8,
}
pub type std_add_volatile_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_cv {
    pub _address: u8,
}
pub type std_add_cv_type = u8;
pub type std_remove_const_t = u8;
pub type std_remove_volatile_t = u8;
pub type std_remove_cv_t = u8;
pub type std_add_const_t = u8;
pub type std_add_volatile_t = u8;
pub type std_add_cv_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_reference {
    pub _address: u8,
}
pub type std_remove_reference_type = u8;
pub type std___add_lvalue_reference_helper_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_lvalue_reference {
    pub _address: u8,
}
pub type std___add_rvalue_reference_helper_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_rvalue_reference {
    pub _address: u8,
}
pub type std_remove_reference_t = u8;
pub type std_add_lvalue_reference_t = u8;
pub type std_add_rvalue_reference_t = u8;
pub type std___match_cv_qualifiers___match = u8;
pub type std___match_cv_qualifiers___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_unsigned {
    pub _address: u8,
}
pub type std___make_unsigned___type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___make_unsigned_selector_base {
    pub _bindgen_opaque_blob: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_unsigned_selector_base__List {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___make_unsigned_selector_base() {
    assert_eq!(
        ::std::mem::size_of::<std___make_unsigned_selector_base>(),
        1usize,
        concat!("Size of: ", stringify!(std___make_unsigned_selector_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___make_unsigned_selector_base>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___make_unsigned_selector_base)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_unsigned {
    pub _address: u8,
}
pub type std_make_unsigned_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_signed {
    pub _address: u8,
}
pub type std___make_signed___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_signed {
    pub _address: u8,
}
pub type std_make_signed_type = u8;
pub type std_make_signed_t = u8;
pub type std_make_unsigned_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_extent {
    pub _address: u8,
}
pub type std_remove_extent_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_all_extents {
    pub _address: u8,
}
pub type std_remove_all_extents_type = u8;
pub type std_remove_extent_t = u8;
pub type std_remove_all_extents_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___remove_pointer_helper {
    pub _address: u8,
}
pub type std___remove_pointer_helper_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_pointer {
    pub _address: u8,
}
pub type std___add_pointer_helper_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_pointer {
    pub _address: u8,
}
pub type std_remove_pointer_t = u8;
pub type std_add_pointer_t = u8;
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union std___aligned_storage_msa___type {
    pub _bindgen_opaque_blob: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___aligned_storage_msa___type__bindgen_ty_1 {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___aligned_storage_msa___type() {
    assert_eq!(
        ::std::mem::size_of::<std___aligned_storage_msa___type>(),
        8usize,
        concat!("Size of: ", stringify!(std___aligned_storage_msa___type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___aligned_storage_msa___type>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std___aligned_storage_msa___type)
        )
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union std_aligned_storage_type {
    pub _bindgen_opaque_blob: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_aligned_storage_type__bindgen_ty_1 {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_aligned_storage_type() {
    assert_eq!(
        ::std::mem::size_of::<std_aligned_storage_type>(),
        8usize,
        concat!("Size of: ", stringify!(std_aligned_storage_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std_aligned_storage_type>(),
        8usize,
        concat!("Alignment of ", stringify!(std_aligned_storage_type))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___strictest_alignment {
    pub _address: u8,
}
pub type std_aligned_union___strictest = u8;
pub type std_aligned_union_type = u8;
extern "C" {
    #[link_name = "\u{1}alignment_value"]
    pub static std_alignment_value: usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_decay {
    pub _address: u8,
}
pub type std_decay___remove_type = u8;
pub type std_decay_type = u8;
pub type std___decay_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___strip_reference_wrapper {
    pub _address: u8,
}
pub type std___strip_reference_wrapper___type = u8;
pub type std___decay_and_strip = u8;
pub type std___enable_if_t = u8;
pub type std__Require = u8;
pub type std_conditional_type = u8;
pub type std___remove_cvref_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_common_type {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___do_common_type_impl {
    pub _bindgen_opaque_blob: u8,
}
pub type std___do_common_type_impl___cond_t = u8;
#[test]
fn bindgen_test_layout_std___do_common_type_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___do_common_type_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___do_common_type_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___do_common_type_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std___do_common_type_impl))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type_impl {
    pub _address: u8,
}
pub type std___common_type_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type_pack {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type_fold {
    pub _address: u8,
}
pub type std___underlying_type_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_underlying_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___declval_protector {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_result_of {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_memfun_ref {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___invoke_memfun_ref() {
    assert_eq!(
        ::std::mem::size_of::<std___invoke_memfun_ref>(),
        1usize,
        concat!("Size of: ", stringify!(std___invoke_memfun_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<std___invoke_memfun_ref>(),
        1usize,
        concat!("Alignment of ", stringify!(std___invoke_memfun_ref))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_memfun_deref {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___invoke_memfun_deref() {
    assert_eq!(
        ::std::mem::size_of::<std___invoke_memfun_deref>(),
        1usize,
        concat!("Size of: ", stringify!(std___invoke_memfun_deref))
    );
    assert_eq!(
        ::std::mem::align_of::<std___invoke_memfun_deref>(),
        1usize,
        concat!("Alignment of ", stringify!(std___invoke_memfun_deref))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_memobj_ref {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___invoke_memobj_ref() {
    assert_eq!(
        ::std::mem::size_of::<std___invoke_memobj_ref>(),
        1usize,
        concat!("Size of: ", stringify!(std___invoke_memobj_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<std___invoke_memobj_ref>(),
        1usize,
        concat!("Alignment of ", stringify!(std___invoke_memobj_ref))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_memobj_deref {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___invoke_memobj_deref() {
    assert_eq!(
        ::std::mem::size_of::<std___invoke_memobj_deref>(),
        1usize,
        concat!("Size of: ", stringify!(std___invoke_memobj_deref))
    );
    assert_eq!(
        ::std::mem::align_of::<std___invoke_memobj_deref>(),
        1usize,
        concat!("Alignment of ", stringify!(std___invoke_memobj_deref))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_other {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___invoke_other() {
    assert_eq!(
        ::std::mem::size_of::<std___invoke_other>(),
        1usize,
        concat!("Size of: ", stringify!(std___invoke_other))
    );
    assert_eq!(
        ::std::mem::align_of::<std___invoke_other>(),
        1usize,
        concat!("Alignment of ", stringify!(std___invoke_other))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_success {
    pub _address: u8,
}
pub type std___result_of_success___invoke_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun_ref_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memfun_ref_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___result_of_memfun_ref_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___result_of_memfun_ref_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___result_of_memfun_ref_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std___result_of_memfun_ref_impl))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun_ref {
    pub _address: u8,
}
pub type std___result_of_memfun_ref_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun_deref_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memfun_deref_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___result_of_memfun_deref_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___result_of_memfun_deref_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___result_of_memfun_deref_impl>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___result_of_memfun_deref_impl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun_deref {
    pub _address: u8,
}
pub type std___result_of_memfun_deref_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj_ref_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memobj_ref_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___result_of_memobj_ref_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___result_of_memobj_ref_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___result_of_memobj_ref_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std___result_of_memobj_ref_impl))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj_ref {
    pub _address: u8,
}
pub type std___result_of_memobj_ref_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj_deref_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memobj_deref_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___result_of_memobj_deref_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___result_of_memobj_deref_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___result_of_memobj_deref_impl>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___result_of_memobj_deref_impl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj_deref {
    pub _address: u8,
}
pub type std___result_of_memobj_deref_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___inv_unwrap {
    pub _address: u8,
}
pub type std___inv_unwrap_type = u8;
pub type std___result_of_impl_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_other_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_other_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___result_of_other_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std___result_of_other_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std___result_of_other_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std___result_of_other_impl))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___invoke_result {
    pub _address: u8,
}
pub type std_aligned_storage_t = u8;
pub type std_aligned_union_t = u8;
pub type std_decay_t = u8;
pub type std_enable_if_t = u8;
pub type std_conditional_t = u8;
pub type std_common_type_t = u8;
pub type std_underlying_type_t = u8;
pub type std_result_of_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___detector {
    pub _address: u8,
}
pub type std___detector_value_t = u8;
pub type std___detector_type = u8;
pub type std___detected_or = u8;
pub type std___detected_or_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_tuple_like_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_tuple_like {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___swappable_details___do_is_swappable_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___swappable_details___do_is_swappable_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___swappable_details___do_is_swappable_impl>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(std___swappable_details___do_is_swappable_impl)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___swappable_details___do_is_swappable_impl>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___swappable_details___do_is_swappable_impl)
        )
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___swappable_details___do_is_nothrow_swappable_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___swappable_details___do_is_nothrow_swappable_impl() {
    assert_eq!(
        ::std::mem::size_of::<std___swappable_details___do_is_nothrow_swappable_impl>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(std___swappable_details___do_is_nothrow_swappable_impl)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___swappable_details___do_is_nothrow_swappable_impl>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(std___swappable_details___do_is_nothrow_swappable_impl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_swappable_impl {
    pub _address: u8,
}
pub type std___is_swappable_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_swappable_impl {
    pub _address: u8,
}
pub type std___is_nothrow_swappable_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_invocable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___call_is_nothrow {
    pub _address: u8,
}
pub type std___call_is_nothrow_ = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_invocable {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___nonesuchbase {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___nonesuchbase() {
    assert_eq!(
        ::std::mem::size_of::<std___nonesuchbase>(),
        1usize,
        concat!("Size of: ", stringify!(std___nonesuchbase))
    );
    assert_eq!(
        ::std::mem::align_of::<std___nonesuchbase>(),
        1usize,
        concat!("Alignment of ", stringify!(std___nonesuchbase))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___nonesuch {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___nonesuch() {
    assert_eq!(
        ::std::mem::size_of::<std___nonesuch>(),
        1usize,
        concat!("Size of: ", stringify!(std___nonesuch))
    );
    assert_eq!(
        ::std::mem::align_of::<std___nonesuch>(),
        1usize,
        concat!("Alignment of ", stringify!(std___nonesuch))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___move_if_noexcept_cond {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_piecewise_construct_t {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_piecewise_construct_t() {
    assert_eq!(
        ::std::mem::size_of::<std_piecewise_construct_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_piecewise_construct_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_piecewise_construct_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_piecewise_construct_t))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZStL19piecewise_construct"]
    pub static std_piecewise_construct: std_piecewise_construct_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___pair_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair {
    pub _address: u8,
}
pub type std_pair_first_type = u8;
pub type std_pair_second_type = u8;
pub type std_pair__PCCP = u8;
pub type std_pair__PCCFP = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_initializer_list {
    pub _address: u8,
}
pub type std_initializer_list_value_type = u8;
pub type std_initializer_list_reference = u8;
pub type std_initializer_list_const_reference = u8;
pub type std_initializer_list_size_type = u64;
pub type std_initializer_list_iterator = u8;
pub type std_initializer_list_const_iterator = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple_size {
    pub _address: u8,
}
pub type std___enable_if_has_tuple_size = u8;
pub type std___tuple_element_t = u8;
pub type std_tuple_element_t = u8;
pub type std__Build_index_tuple__IdxTuple = u8;
pub type std__Build_index_tuple___type = u8;
pub type std_integer_sequence_value_type = u8;
pub type std_make_integer_sequence = u8;
pub type std_index_sequence = u8;
pub type std_make_index_sequence = u8;
pub type std_index_sequence_for = u8;
extern "C" {
    #[link_name = "\u{1}_ZSt21__throw_bad_exceptionv"]
    pub fn std___throw_bad_exception() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt17__throw_bad_allocv"]
    pub fn std___throw_bad_alloc() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt16__throw_bad_castv"]
    pub fn std___throw_bad_cast() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt18__throw_bad_typeidv"]
    pub fn std___throw_bad_typeid() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_logic_errorPKc"]
    pub fn std___throw_logic_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_domain_errorPKc"]
    pub fn std___throw_domain_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt24__throw_invalid_argumentPKc"]
    pub fn std___throw_invalid_argument(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_length_errorPKc"]
    pub fn std___throw_length_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_out_of_rangePKc"]
    pub fn std___throw_out_of_range(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt24__throw_out_of_range_fmtPKcz"]
    pub fn std___throw_out_of_range_fmt(arg1: *const ::std::os::raw::c_char, ...) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt21__throw_runtime_errorPKc"]
    pub fn std___throw_runtime_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_range_errorPKc"]
    pub fn std___throw_range_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt22__throw_overflow_errorPKc"]
    pub fn std___throw_overflow_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt23__throw_underflow_errorPKc"]
    pub fn std___throw_underflow_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_ios_failurePKc"]
    pub fn std___throw_ios_failure(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_ios_failurePKci"]
    pub fn std___throw_ios_failure1(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_system_errori"]
    pub fn std___throw_system_error(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_future_errori"]
    pub fn std___throw_future_error(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt25__throw_bad_function_callv"]
    pub fn std___throw_bad_function_call() -> !;
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___true_type {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___true_type() {
    assert_eq!(
        ::std::mem::size_of::<std___true_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___true_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___true_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___true_type))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___false_type {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___false_type() {
    assert_eq!(
        ::std::mem::size_of::<std___false_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___false_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___false_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___false_type))
    );
}
pub type std___truth_type___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___traitor {
    pub _address: u8,
}
pub const std___traitor___value: std___traitor__bindgen_ty_1 = 0;
pub type std___traitor__bindgen_ty_1 = i32;
pub type std___traitor___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___are_same {
    pub _address: u8,
}
pub const std___are_same___value: std___are_same__bindgen_ty_1 = 0;
pub type std___are_same__bindgen_ty_1 = i32;
pub type std___are_same___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_void {
    pub _address: u8,
}
pub const std___is_void___value: std___is_void__bindgen_ty_1 = 0;
pub type std___is_void__bindgen_ty_1 = i32;
pub type std___is_void___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_integer {
    pub _address: u8,
}
pub const std___is_integer___value: std___is_integer__bindgen_ty_1 = 0;
pub type std___is_integer__bindgen_ty_1 = i32;
pub type std___is_integer___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_floating {
    pub _address: u8,
}
pub const std___is_floating___value: std___is_floating__bindgen_ty_1 = 0;
pub type std___is_floating__bindgen_ty_1 = i32;
pub type std___is_floating___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_pointer {
    pub _address: u8,
}
pub const std___is_pointer___value: std___is_pointer__bindgen_ty_1 = 0;
pub type std___is_pointer__bindgen_ty_1 = i32;
pub type std___is_pointer___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_scalar {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_char {
    pub _address: u8,
}
pub const std___is_char___value: std___is_char__bindgen_ty_1 = 0;
pub type std___is_char__bindgen_ty_1 = i32;
pub type std___is_char___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_byte {
    pub _address: u8,
}
pub const std___is_byte___value: std___is_byte__bindgen_ty_1 = 0;
pub type std___is_byte__bindgen_ty_1 = i32;
pub type std___is_byte___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nonvolatile_trivially_copyable {
    pub _address: u8,
}
pub const std___is_nonvolatile_trivially_copyable___value:
    std___is_nonvolatile_trivially_copyable__bindgen_ty_1 = 0;
pub type std___is_nonvolatile_trivially_copyable__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___memcpyable {
    pub _address: u8,
}
pub const std___memcpyable___value: std___memcpyable__bindgen_ty_1 = 0;
pub type std___memcpyable__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___memcmpable {
    pub _address: u8,
}
pub const std___memcmpable___value: std___memcmpable__bindgen_ty_1 = 0;
pub type std___memcmpable__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_move_iterator {
    pub _address: u8,
}
pub const std___is_move_iterator___value: std___is_move_iterator__bindgen_ty_1 = 0;
pub type std___is_move_iterator__bindgen_ty_1 = i32;
pub type std___is_move_iterator___type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_input_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_input_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_input_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_input_iterator_tag))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_output_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_output_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_output_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_output_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_output_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_output_iterator_tag))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_forward_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_forward_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_forward_iterator_tag))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_bidirectional_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_bidirectional_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_bidirectional_iterator_tag))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_random_access_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_random_access_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_random_access_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_random_access_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_random_access_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_random_access_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_iterator_category = u8;
pub type std_iterator_value_type = u8;
pub type std_iterator_difference_type = u8;
pub type std_iterator_pointer = u8;
pub type std_iterator_reference = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iterator_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator_traits {
    pub _address: u8,
}
pub type std___iterator_category_t = u8;
pub type std__RequireInputIter = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_random_access_iter {
    pub _address: u8,
}
pub type std___is_random_access_iter__Base = u8;
pub const std___is_random_access_iter___value: std___is_random_access_iter__bindgen_ty_1 = 0;
pub type std___is_random_access_iter__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___undefined {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___get_first_arg {
    pub _address: u8,
}
pub type std___get_first_arg_type = u8;
pub type std___get_first_arg_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___replace_first_arg {
    pub _address: u8,
}
pub type std___replace_first_arg_t = u8;
pub type std___make_not_void = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits {
    pub _address: u8,
}
pub type std_pointer_traits___element_type = u8;
pub type std_pointer_traits___difference_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits___rebind {
    pub _address: u8,
}
pub type std_pointer_traits_pointer = u8;
pub type std_pointer_traits_element_type = u8;
pub type std_pointer_traits_difference_type = u8;
pub type std_pointer_traits_rebind = u8;
pub type std___ptr_rebind = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator {
    pub _address: u8,
}
pub type std_reverse_iterator___traits_type = u8;
pub type std_reverse_iterator_iterator_type = u8;
pub type std_reverse_iterator_difference_type = u8;
pub type std_reverse_iterator_pointer = u8;
pub type std_reverse_iterator_reference = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_back_insert_iterator {
    pub _address: u8,
}
pub type std_back_insert_iterator_container_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_front_insert_iterator {
    pub _address: u8,
}
pub type std_front_insert_iterator_container_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_insert_iterator {
    pub _address: u8,
}
pub type std_insert_iterator__Iter = u8;
pub type std_insert_iterator_container_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_move_iterator {
    pub _address: u8,
}
pub type std_move_iterator___traits_type = u8;
pub type std_move_iterator___base_ref = u8;
pub type std_move_iterator_iterator_type = u8;
pub type std_move_iterator_iterator_category = u8;
pub type std_move_iterator_value_type = u8;
pub type std_move_iterator_difference_type = u8;
pub type std_move_iterator_pointer = u8;
pub type std_move_iterator_reference = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istreambuf_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostreambuf_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Deque_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___lc_rai {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_valarray {
    pub _address: u8,
}
pub type std___array_traits__Type = u8;
pub type std___array_traits__Is_swappable = u8;
pub type std___array_traits__Is_nothrow_swappable = u8;
pub type std_array_value_type = u8;
pub type std_array_pointer = u8;
pub type std_array_const_pointer = u8;
pub type std_array_reference = u8;
pub type std_array_const_reference = u8;
pub type std_array_iterator = u8;
pub type std_array_const_iterator = u8;
pub type std_array_size_type = u64;
pub type std_array_difference_type = u64;
pub type std_array_reverse_iterator = u8;
pub type std_array_const_reverse_iterator = u8;
pub type std_array__AT_Type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___erased_type {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___erased_type() {
    assert_eq!(
        ::std::mem::size_of::<std___erased_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___erased_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___erased_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___erased_type))
    );
}
pub type std___is_erased_or_convertible = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_arg_t {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_allocator_arg_t() {
    assert_eq!(
        ::std::mem::size_of::<std_allocator_arg_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_allocator_arg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_allocator_arg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_allocator_arg_t))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZStL13allocator_arg"]
    pub static std_allocator_arg: std_allocator_arg_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_allocator_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uses_allocator {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc_base {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___uses_alloc_base() {
    assert_eq!(
        ::std::mem::size_of::<std___uses_alloc_base>(),
        1usize,
        concat!("Size of: ", stringify!(std___uses_alloc_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___uses_alloc_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std___uses_alloc_base))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc0 {
    pub _bindgen_opaque_blob: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc0__Sink {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___uses_alloc0__Sink() {
    assert_eq!(
        ::std::mem::size_of::<std___uses_alloc0__Sink>(),
        1usize,
        concat!("Size of: ", stringify!(std___uses_alloc0__Sink))
    );
    assert_eq!(
        ::std::mem::align_of::<std___uses_alloc0__Sink>(),
        1usize,
        concat!("Alignment of ", stringify!(std___uses_alloc0__Sink))
    );
}
#[test]
fn bindgen_test_layout_std___uses_alloc0() {
    assert_eq!(
        ::std::mem::size_of::<std___uses_alloc0>(),
        1usize,
        concat!("Size of: ", stringify!(std___uses_alloc0))
    );
    assert_eq!(
        ::std::mem::align_of::<std___uses_alloc0>(),
        1usize,
        concat!("Alignment of ", stringify!(std___uses_alloc0))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc1 {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc2 {
    pub _address: u8,
}
pub type std___uses_alloc_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_uses_allocator_predicate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_uses_allocator_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nothrow_uses_allocator_constructible {
    pub _address: u8,
}
pub type std___can_invoke_as_void = u8;
pub type std___can_invoke_as_nonvoid = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_empty_non_tuple {
    pub _address: u8,
}
pub type std___empty_not_final = u8;
pub type std__TupleConstraints_is_constructible = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple {
    pub _address: u8,
}
pub type std_tuple__Inherited = u8;
pub type std_tuple__TCC = u8;
pub type std_tuple__ImplicitDefaultCtor = u8;
pub type std_tuple__ExplicitDefaultCtor = u8;
pub type std_tuple__ImplicitCtor = u8;
pub type std_tuple__ExplicitCtor = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple__UseOtherCtor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___do_make_tuple {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_tuple {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___combine_tuples {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_cat_result {
    pub _address: u8,
}
pub type std___tuple_cat_result___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_1st_indices {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_concater {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std__Swallow_assign {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std__Swallow_assign() {
    assert_eq!(
        ::std::mem::size_of::<std__Swallow_assign>(),
        1usize,
        concat!("Size of: ", stringify!(std__Swallow_assign))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Swallow_assign>(),
        1usize,
        concat!("Alignment of ", stringify!(std__Swallow_assign))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZStL6ignore"]
    pub static std_ignore: std__Swallow_assign;
}
pub const std___safe_multiply___c: uintmax_t = 4294967296;
extern "C" {
    #[link_name = "\u{1}__a0"]
    pub static std___safe_multiply___a0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__a1"]
    pub static std___safe_multiply___a1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__b0"]
    pub static std___safe_multiply___b0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__b1"]
    pub static std___safe_multiply___b1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}value"]
    pub static std___safe_multiply_value: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}__lo"]
    pub static std___big_add___lo: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__hi"]
    pub static std___big_add___hi: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__lo"]
    pub static std___big_sub___lo: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__hi"]
    pub static std___big_sub___hi: uintmax_t;
}
pub const std___big_mul___c: uintmax_t = 4294967296;
extern "C" {
    #[link_name = "\u{1}__x0"]
    pub static std___big_mul___x0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__x1"]
    pub static std___big_mul___x1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__y0"]
    pub static std___big_mul___y0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__y1"]
    pub static std___big_mul___y1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__x0y0"]
    pub static std___big_mul___x0y0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__x0y1"]
    pub static std___big_mul___x0y1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__x1y0"]
    pub static std___big_mul___x1y0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__x1y1"]
    pub static std___big_mul___x1y1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__mix"]
    pub static std___big_mul___mix: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__mix_lo"]
    pub static std___big_mul___mix_lo: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__mix_hi"]
    pub static std___big_mul___mix_hi: uintmax_t;
}
pub type std___big_mul__Res = u8;
extern "C" {
    #[link_name = "\u{1}__hi"]
    pub static std___big_mul___hi: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__lo"]
    pub static std___big_mul___lo: uintmax_t;
}
pub const std___big_div_impl___c: uintmax_t = 4294967296;
extern "C" {
    #[link_name = "\u{1}__d1"]
    pub static std___big_div_impl___d1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__d0"]
    pub static std___big_div_impl___d0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__q1x"]
    pub static std___big_div_impl___q1x: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r1x"]
    pub static std___big_div_impl___r1x: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__m"]
    pub static std___big_div_impl___m: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r1y"]
    pub static std___big_div_impl___r1y: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r1z"]
    pub static std___big_div_impl___r1z: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r1"]
    pub static std___big_div_impl___r1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__q1"]
    pub static std___big_div_impl___q1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__q0x"]
    pub static std___big_div_impl___q0x: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r0x"]
    pub static std___big_div_impl___r0x: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__n"]
    pub static std___big_div_impl___n: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r0y"]
    pub static std___big_div_impl___r0y: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r0z"]
    pub static std___big_div_impl___r0z: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__r0"]
    pub static std___big_div_impl___r0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__q0"]
    pub static std___big_div_impl___q0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__quot"]
    pub static std___big_div_impl___quot: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__rem"]
    pub static std___big_div_impl___rem: uintmax_t;
}
pub type std___big_div_impl__Prod = u8;
pub type std___big_div_impl__Sum = u8;
extern "C" {
    #[link_name = "\u{1}__shift"]
    pub static std___big_div___shift: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__coshift_"]
    pub static std___big_div___coshift_: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__coshift"]
    pub static std___big_div___coshift: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__c1"]
    pub static std___big_div___c1: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__c2"]
    pub static std___big_div___c2: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__new_d"]
    pub static std___big_div___new_d: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__new_n0"]
    pub static std___big_div___new_n0: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__n1_shifted"]
    pub static std___big_div___n1_shifted: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__n0_top"]
    pub static std___big_div___n0_top: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__new_n1"]
    pub static std___big_div___new_n1: uintmax_t;
}
pub type std___big_div__Res = u8;
extern "C" {
    #[link_name = "\u{1}__quot_hi"]
    pub static std___big_div___quot_hi: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__quot_lo"]
    pub static std___big_div___quot_lo: uintmax_t;
}
extern "C" {
    #[link_name = "\u{1}__rem"]
    pub static std___big_div___rem: uintmax_t;
}
pub type std___big_div__P0 = u8;
pub type std___big_div__P1 = u8;
pub type std___big_div__Sum = u8;
extern "C" {
    #[link_name = "\u{1}num"]
    pub static std_ratio_num: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}den"]
    pub static std_ratio_den: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}num"]
    pub static std_num: intmax_t;
}
extern "C" {
    #[link_name = "\u{1}den"]
    pub static std_den: intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_multiply {
    pub _address: u8,
}
pub type std___ratio_multiply_type = u8;
pub type std_ratio_multiply = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_divide {
    pub _address: u8,
}
pub type std___ratio_divide_type = u8;
pub type std_ratio_divide = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_not_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_less_impl_1 {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_less_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_greater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ratio_greater_equal {
    pub _address: u8,
}
pub type std___ratio_add_impl___t = u8;
pub type std___ratio_add_impl_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_add {
    pub _address: u8,
}
pub type std___ratio_add_type = u8;
pub type std_ratio_add = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ratio_subtract {
    pub _address: u8,
}
pub type std___ratio_subtract_type = u8;
pub type std_ratio_subtract = u8;
pub type std_atto = u8;
pub type std_femto = u8;
pub type std_pico = u8;
pub type std_nano = u8;
pub type std_micro = u8;
pub type std_milli = u8;
pub type std_centi = u8;
pub type std_deci = u8;
pub type std_deca = u8;
pub type std_hecto = u8;
pub type std_kilo = u8;
pub type std_mega = u8;
pub type std_giga = u8;
pub type std_tera = u8;
pub type std_peta = u8;
pub type std_exa = u8;
pub const std_float_round_style_round_indeterminate: std_float_round_style = -1;
pub const std_float_round_style_round_toward_zero: std_float_round_style = 0;
pub const std_float_round_style_round_to_nearest: std_float_round_style = 1;
pub const std_float_round_style_round_toward_infinity: std_float_round_style = 2;
pub const std_float_round_style_round_toward_neg_infinity: std_float_round_style = 3;
pub type std_float_round_style = ::std::os::raw::c_int;
pub const std_float_denorm_style_denorm_indeterminate: std_float_denorm_style = -1;
pub const std_float_denorm_style_denorm_absent: std_float_denorm_style = 0;
pub const std_float_denorm_style_denorm_present: std_float_denorm_style = 1;
pub type std_float_denorm_style = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___numeric_limits_base {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___numeric_limits_base() {
    assert_eq!(
        ::std::mem::size_of::<std___numeric_limits_base>(),
        1usize,
        concat!("Size of: ", stringify!(std___numeric_limits_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___numeric_limits_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std___numeric_limits_base))
    );
}
pub const std___numeric_limits_base_is_specialized: bool = false;
pub const std___numeric_limits_base_digits: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_digits10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_max_digits10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_is_signed: bool = false;
pub const std___numeric_limits_base_is_integer: bool = false;
pub const std___numeric_limits_base_is_exact: bool = false;
pub const std___numeric_limits_base_radix: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_min_exponent: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_min_exponent10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_max_exponent: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_max_exponent10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_has_infinity: bool = false;
pub const std___numeric_limits_base_has_quiet_NaN: bool = false;
pub const std___numeric_limits_base_has_signaling_NaN: bool = false;
extern "C" {
    #[link_name = "\u{1}_ZNSt21__numeric_limits_base10has_denormE"]
    pub static std___numeric_limits_base_has_denorm: std_float_denorm_style;
}
pub const std___numeric_limits_base_has_denorm_loss: bool = false;
pub const std___numeric_limits_base_is_iec559: bool = false;
pub const std___numeric_limits_base_is_bounded: bool = false;
pub const std___numeric_limits_base_is_modulo: bool = false;
pub const std___numeric_limits_base_traps: bool = false;
pub const std___numeric_limits_base_tinyness_before: bool = false;
extern "C" {
    #[link_name = "\u{1}_ZNSt21__numeric_limits_base11round_styleE"]
    pub static std___numeric_limits_base_round_style: std_float_round_style;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numeric_limits {
    pub _address: u8,
}
pub type std___parse_int__Digit_impl___valid = u8;
pub type std___parse_int___ull_constant = u8;
pub type std___parse_int__Power_help___next = u8;
pub type std___parse_int__Power_help___valid_digit = u8;
pub type std___parse_int__Power_help_type = u8;
pub type std___parse_int__Number_help___digit = u8;
pub type std___parse_int__Number_help___valid_digit = u8;
pub type std___parse_int__Number_help_type = u8;
pub type std___select_int__Select_int = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___is_duration {
    pub _address: u8,
}
pub type std_chrono___enable_if_is_duration = u8;
pub type std_chrono___disable_if_is_duration = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_treat_as_floating_point {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration_values {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono___is_ratio {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration {
    pub _address: u8,
}
pub type std_chrono_duration___is_float = u8;
pub type std_chrono_duration___divide = u8;
pub type std_chrono_duration___is_harmonic = u8;
pub type std_chrono_duration_rep = u8;
pub type std_chrono_duration_period = u8;
pub type std_chrono___common_rep_t = u8;
pub type std_chrono_nanoseconds = u64;
pub type std_chrono_microseconds = u64;
pub type std_chrono_milliseconds = u64;
pub type std_chrono_seconds = u64;
pub type std_chrono_minutes = u64;
pub type std_chrono_hours = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_time_point {
    pub _address: u8,
}
pub type std_chrono_time_point_clock = u8;
pub type std_chrono_time_point_duration = u8;
pub type std_chrono_time_point_rep = u8;
pub type std_chrono_time_point_period = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_system_clock {
    pub _bindgen_opaque_blob: u8,
}
pub type std_chrono_system_clock_duration = u64;
pub type std_chrono_system_clock_rep = u64;
pub type std_chrono_system_clock_period = u8;
pub type std_chrono_system_clock_time_point = u64;
#[test]
fn bindgen_test_layout_std_chrono_system_clock() {
    assert_eq!(
        ::std::mem::size_of::<std_chrono_system_clock>(),
        1usize,
        concat!("Size of: ", stringify!(std_chrono_system_clock))
    );
    assert_eq!(
        ::std::mem::align_of::<std_chrono_system_clock>(),
        1usize,
        concat!("Alignment of ", stringify!(std_chrono_system_clock))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6chrono3_V212system_clock3nowEv"]
    pub fn std_chrono_system_clock_now() -> std_chrono_system_clock_time_point;
}
impl std_chrono_system_clock {
    #[inline]
    pub unsafe fn now() -> std_chrono_system_clock_time_point {
        std_chrono_system_clock_now()
    }
}
pub const std_chrono_system_clock_is_steady: bool = false;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_steady_clock {
    pub _bindgen_opaque_blob: u8,
}
pub type std_chrono_steady_clock_duration = u64;
pub type std_chrono_steady_clock_rep = u64;
pub type std_chrono_steady_clock_period = u8;
pub type std_chrono_steady_clock_time_point = u8;
#[test]
fn bindgen_test_layout_std_chrono_steady_clock() {
    assert_eq!(
        ::std::mem::size_of::<std_chrono_steady_clock>(),
        1usize,
        concat!("Size of: ", stringify!(std_chrono_steady_clock))
    );
    assert_eq!(
        ::std::mem::align_of::<std_chrono_steady_clock>(),
        1usize,
        concat!("Alignment of ", stringify!(std_chrono_steady_clock))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6chrono3_V212steady_clock3nowEv"]
    pub fn std_chrono_steady_clock_now() -> std_chrono_steady_clock_time_point;
}
impl std_chrono_steady_clock {
    #[inline]
    pub unsafe fn now() -> std_chrono_steady_clock_time_point {
        std_chrono_steady_clock_now()
    }
}
pub const std_chrono_steady_clock_is_steady: bool = true;
pub type std_chrono_high_resolution_clock = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___duration_common_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___timepoint_common_type {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_exception {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9exceptionD1Ev"]
    pub fn std_exception_exception_destructor(this: *mut std_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9exception4whatEv"]
    pub fn std_exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_exception {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_bad_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13bad_exceptionD1Ev"]
    pub fn std_bad_exception_bad_exception_destructor(this: *mut std_bad_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt13bad_exception4whatEv"]
    pub fn std_bad_exception_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type std_terminate_handler = u64;
pub type std_unexpected_handler = u64;
extern "C" {
    #[link_name = "\u{1}_ZSt13set_terminatePFvvE"]
    pub fn std_set_terminate(arg1: std_terminate_handler) -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt13get_terminatev"]
    pub fn std_get_terminate() -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt9terminatev"]
    pub fn std_terminate() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt14set_unexpectedPFvvE"]
    pub fn std_set_unexpected(arg1: std_unexpected_handler) -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt14get_unexpectedv"]
    pub fn std_get_unexpected() -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt10unexpectedv"]
    pub fn std_unexpected() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt18uncaught_exceptionv"]
    pub fn std_uncaught_exception() -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZSt11_Hash_bytesPKvyy"]
    pub fn std__Hash_bytes(
        __ptr: *const ::std::os::raw::c_void,
        __len: usize,
        __seed: usize,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}_ZSt15_Fnv_hash_bytesPKvyy"]
    pub fn std__Fnv_hash_bytes(
        __ptr: *const ::std::os::raw::c_void,
        __len: usize,
        __seed: usize,
    ) -> usize;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_type_info {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_type_info() {
    assert_eq!(
        ::std::mem::size_of::<std_type_info>(),
        16usize,
        concat!("Size of: ", stringify!(std_type_info))
    );
    assert_eq!(
        ::std::mem::align_of::<std_type_info>(),
        8usize,
        concat!("Alignment of ", stringify!(std_type_info))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9type_infoD1Ev"]
    pub fn std_type_info_type_info_destructor(this: *mut std_type_info);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info14__is_pointer_pEv"]
    pub fn std_type_info___is_pointer_p(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info15__is_function_pEv"]
    pub fn std_type_info___is_function_p(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info10__do_catchEPKS_PPvj"]
    pub fn std_type_info___do_catch(
        this: *mut ::std::os::raw::c_void,
        __thr_type: *const std_type_info,
        __thr_obj: *mut *mut ::std::os::raw::c_void,
        __outer: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info11__do_upcastEPKN10__cxxabiv117__class_type_infoEPPv"]
    pub fn std_type_info___do_upcast(
        this: *mut ::std::os::raw::c_void,
        __target: *const __cxxabiv1___class_type_info,
        __obj_ptr: *mut *mut ::std::os::raw::c_void,
    ) -> bool;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_cast {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_bad_cast() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_cast>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_cast))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_cast>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_cast))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8bad_castD1Ev"]
    pub fn std_bad_cast_bad_cast_destructor(this: *mut std_bad_cast);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt8bad_cast4whatEv"]
    pub fn std_bad_cast_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_typeid {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_bad_typeid() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_typeid>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_typeid))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_typeid>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_typeid))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10bad_typeidD1Ev"]
    pub fn std_bad_typeid_bad_typeid_destructor(this: *mut std_bad_typeid);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt10bad_typeid4whatEv"]
    pub fn std_bad_typeid_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_alloc {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_bad_alloc() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_alloc>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_alloc))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_alloc>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_alloc))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9bad_allocD1Ev"]
    pub fn std_bad_alloc_bad_alloc_destructor(this: *mut std_bad_alloc);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9bad_alloc4whatEv"]
    pub fn std_bad_alloc_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_array_new_length {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_bad_array_new_length() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_array_new_length>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_array_new_length))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_array_new_length>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_array_new_length))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt20bad_array_new_lengthD1Ev"]
    pub fn std_bad_array_new_length_bad_array_new_length_destructor(
        this: *mut std_bad_array_new_length,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt20bad_array_new_length4whatEv"]
    pub fn std_bad_array_new_length_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_nothrow_t {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_nothrow_t() {
    assert_eq!(
        ::std::mem::size_of::<std_nothrow_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_nothrow_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_nothrow_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_nothrow_t))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt7nothrow"]
    pub static std_nothrow: std_nothrow_t;
}
pub type std_new_handler = u64;
extern "C" {
    #[link_name = "\u{1}_ZSt15set_new_handlerPFvvE"]
    pub fn std_set_new_handler(arg1: std_new_handler) -> std_new_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt15get_new_handlerv"]
    pub fn std_get_new_handler() -> std_new_handler;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std___exception_ptr_exception_ptr {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std___exception_ptr_exception_ptr() {
    assert_eq!(
        ::std::mem::size_of::<std___exception_ptr_exception_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(std___exception_ptr_exception_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<std___exception_ptr_exception_ptr>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(std___exception_ptr_exception_ptr)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15__exception_ptr13exception_ptr4swapERS0_"]
    pub fn std___exception_ptr_exception_ptr_swap(
        this: *mut std___exception_ptr_exception_ptr,
        arg1: *mut std___exception_ptr_exception_ptr,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv"]
    pub fn std___exception_ptr_exception_ptr___cxa_exception_type(
        this: *const std___exception_ptr_exception_ptr,
    ) -> *const std_type_info;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15__exception_ptr13exception_ptrC1Ev"]
    pub fn std___exception_ptr_exception_ptr_exception_ptr(
        this: *mut std___exception_ptr_exception_ptr,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15__exception_ptr13exception_ptrC1ERKS0_"]
    pub fn std___exception_ptr_exception_ptr_exception_ptr1(
        this: *mut std___exception_ptr_exception_ptr,
        arg1: *const std___exception_ptr_exception_ptr,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15__exception_ptr13exception_ptrD1Ev"]
    pub fn std___exception_ptr_exception_ptr_exception_ptr_destructor(
        this: *mut std___exception_ptr_exception_ptr,
    );
}
impl std___exception_ptr_exception_ptr {
    #[inline]
    pub unsafe fn swap(&mut self, arg1: *mut std___exception_ptr_exception_ptr) {
        std___exception_ptr_exception_ptr_swap(self, arg1)
    }
    #[inline]
    pub unsafe fn __cxa_exception_type(&self) -> *const std_type_info {
        std___exception_ptr_exception_ptr___cxa_exception_type(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___exception_ptr_exception_ptr_exception_ptr(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std___exception_ptr_exception_ptr) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___exception_ptr_exception_ptr_exception_ptr1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___exception_ptr_exception_ptr_exception_ptr_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZSt17current_exceptionv"]
    pub fn std_current_exception() -> std___exception_ptr_exception_ptr;
}
extern "C" {
    #[link_name = "\u{1}_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE"]
    pub fn std_rethrow_exception(arg1: std___exception_ptr_exception_ptr) -> !;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_nested_exception {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_nested_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_nested_exception>(),
        16usize,
        concat!("Size of: ", stringify!(std_nested_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_nested_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_nested_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16nested_exceptionD1Ev"]
    pub fn std_nested_exception_nested_exception_destructor(this: *mut std_nested_exception);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Nested_exception {
    pub _address: u8,
}
pub type std___rethrow_if_nested_cond = u8;
pub const std_errc_address_family_not_supported: std_errc = 102;
pub const std_errc_address_in_use: std_errc = 100;
pub const std_errc_address_not_available: std_errc = 101;
pub const std_errc_already_connected: std_errc = 113;
pub const std_errc_argument_list_too_long: std_errc = 7;
pub const std_errc_argument_out_of_domain: std_errc = 33;
pub const std_errc_bad_address: std_errc = 14;
pub const std_errc_bad_file_descriptor: std_errc = 9;
pub const std_errc_bad_message: std_errc = 104;
pub const std_errc_broken_pipe: std_errc = 32;
pub const std_errc_connection_aborted: std_errc = 106;
pub const std_errc_connection_already_in_progress: std_errc = 103;
pub const std_errc_connection_refused: std_errc = 107;
pub const std_errc_connection_reset: std_errc = 108;
pub const std_errc_cross_device_link: std_errc = 18;
pub const std_errc_destination_address_required: std_errc = 109;
pub const std_errc_device_or_resource_busy: std_errc = 16;
pub const std_errc_directory_not_empty: std_errc = 41;
pub const std_errc_executable_format_error: std_errc = 8;
pub const std_errc_file_exists: std_errc = 17;
pub const std_errc_file_too_large: std_errc = 27;
pub const std_errc_filename_too_long: std_errc = 38;
pub const std_errc_function_not_supported: std_errc = 40;
pub const std_errc_host_unreachable: std_errc = 110;
pub const std_errc_identifier_removed: std_errc = 111;
pub const std_errc_illegal_byte_sequence: std_errc = 42;
pub const std_errc_inappropriate_io_control_operation: std_errc = 25;
pub const std_errc_interrupted: std_errc = 4;
pub const std_errc_invalid_argument: std_errc = 22;
pub const std_errc_invalid_seek: std_errc = 29;
pub const std_errc_io_error: std_errc = 5;
pub const std_errc_is_a_directory: std_errc = 21;
pub const std_errc_message_size: std_errc = 115;
pub const std_errc_network_down: std_errc = 116;
pub const std_errc_network_reset: std_errc = 117;
pub const std_errc_network_unreachable: std_errc = 118;
pub const std_errc_no_buffer_space: std_errc = 119;
pub const std_errc_no_child_process: std_errc = 10;
pub const std_errc_no_link: std_errc = 121;
pub const std_errc_no_lock_available: std_errc = 39;
pub const std_errc_no_message_available: std_errc = 120;
pub const std_errc_no_message: std_errc = 122;
pub const std_errc_no_protocol_option: std_errc = 123;
pub const std_errc_no_space_on_device: std_errc = 28;
pub const std_errc_no_stream_resources: std_errc = 124;
pub const std_errc_no_such_device_or_address: std_errc = 6;
pub const std_errc_no_such_device: std_errc = 19;
pub const std_errc_no_such_file_or_directory: std_errc = 2;
pub const std_errc_no_such_process: std_errc = 3;
pub const std_errc_not_a_directory: std_errc = 20;
pub const std_errc_not_a_socket: std_errc = 128;
pub const std_errc_not_a_stream: std_errc = 125;
pub const std_errc_not_connected: std_errc = 126;
pub const std_errc_not_enough_memory: std_errc = 12;
pub const std_errc_not_supported: std_errc = 129;
pub const std_errc_operation_canceled: std_errc = 105;
pub const std_errc_operation_in_progress: std_errc = 112;
pub const std_errc_operation_not_permitted: std_errc = 1;
pub const std_errc_operation_not_supported: std_errc = 130;
pub const std_errc_operation_would_block: std_errc = 140;
pub const std_errc_owner_dead: std_errc = 133;
pub const std_errc_permission_denied: std_errc = 13;
pub const std_errc_protocol_error: std_errc = 134;
pub const std_errc_protocol_not_supported: std_errc = 135;
pub const std_errc_read_only_file_system: std_errc = 30;
pub const std_errc_resource_deadlock_would_occur: std_errc = 36;
pub const std_errc_resource_unavailable_try_again: std_errc = 11;
pub const std_errc_result_out_of_range: std_errc = 34;
pub const std_errc_state_not_recoverable: std_errc = 127;
pub const std_errc_stream_timeout: std_errc = 137;
pub const std_errc_text_file_busy: std_errc = 139;
pub const std_errc_timed_out: std_errc = 138;
pub const std_errc_too_many_files_open_in_system: std_errc = 23;
pub const std_errc_too_many_files_open: std_errc = 24;
pub const std_errc_too_many_links: std_errc = 31;
pub const std_errc_too_many_symbolic_link_levels: std_errc = 114;
pub const std_errc_value_too_large: std_errc = 132;
pub const std_errc_wrong_protocol_type: std_errc = 136;
pub type std_errc = ::std::os::raw::c_int;
pub type std_string = [u64; 4usize];
pub type std_wstring = [u64; 4usize];
pub type std_u16string = [u64; 4usize];
pub type std_u32string = [u64; 4usize];
pub type std_streamoff = u64;
pub type std_streamsize = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fpos {
    pub _address: u8,
}
pub type std_streampos = u8;
pub type std_wstreampos = u8;
pub type std_u16streampos = u8;
pub type std_u32streampos = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ios {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_streambuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_iostream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_filebuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ifstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ofstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_fstream {
    pub _address: u8,
}
pub type std_ios = u8;
pub type std_streambuf = u8;
pub type std_istream = u8;
pub type std_ostream = u8;
pub type std_iostream = u8;
pub type std_stringbuf = u8;
pub type std_istringstream = u8;
pub type std_ostringstream = u8;
pub type std_stringstream = u8;
pub type std_filebuf = u8;
pub type std_ifstream = u8;
pub type std_ofstream = u8;
pub type std_fstream = u8;
pub type std_wios = u8;
pub type std_wstreambuf = u8;
pub type std_wistream = u8;
pub type std_wostream = u8;
pub type std_wiostream = u8;
pub type std_wstringbuf = u8;
pub type std_wistringstream = u8;
pub type std_wostringstream = u8;
pub type std_wstringstream = u8;
pub type std_wfilebuf = u8;
pub type std_wifstream = u8;
pub type std_wofstream = u8;
pub type std_wfstream = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
pub type std___allocator_base = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator_value_type = u8;
pub type std_allocator_size_type = u64;
pub type std_allocator_difference_type = u64;
pub type std_allocator_pointer = u8;
pub type std_allocator_const_pointer = u8;
pub type std_allocator_reference = u8;
pub type std_allocator_const_reference = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = u8;
pub type std_allocator_propagate_on_container_move_assignment = u8;
pub type std_allocator_is_always_equal = u8;
pub type std___c_locale = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype_base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ctype_byname {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt_base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt_byname {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_num_get {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_num_put {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_put {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_put_byname {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_messages_base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_function {
    pub _address: u8,
}
pub type std_unary_function_argument_type = u8;
pub type std_unary_function_result_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_function {
    pub _address: u8,
}
pub type std_binary_function_first_argument_type = u8;
pub type std_binary_function_second_argument_type = u8;
pub type std_binary_function_result_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_transparent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_plus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_minus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_multiplies {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_divides {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_modulus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_negate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_equal_to {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_not_equal_to {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_and {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_or {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_not {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_and {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_or {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_xor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_not {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_negate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_negate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_unary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_binary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Identity {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Select1st {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Select2nd {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_ref_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_ref_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_ref_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_ref_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binder1st {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binder2nd {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_traits_base {
    pub _bindgen_opaque_blob: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_traits_base___rebind {
    pub _address: u8,
}
pub type std___allocator_traits_base___pointer = u8;
pub type std___allocator_traits_base___c_pointer = u8;
pub type std___allocator_traits_base___v_pointer = u8;
pub type std___allocator_traits_base___cv_pointer = u8;
pub type std___allocator_traits_base___pocca = u8;
pub type std___allocator_traits_base___pocma = u8;
pub type std___allocator_traits_base___pocs = u8;
pub type std___allocator_traits_base___equal = u8;
#[test]
fn bindgen_test_layout_std___allocator_traits_base() {
    assert_eq!(
        ::std::mem::size_of::<std___allocator_traits_base>(),
        1usize,
        concat!("Size of: ", stringify!(std___allocator_traits_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___allocator_traits_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std___allocator_traits_base))
    );
}
pub type std___alloc_rebind = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub type std_allocator_traits_allocator_type = u8;
pub type std_allocator_traits_value_type = u8;
pub type std_allocator_traits_pointer = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits__Ptr {
    pub _address: u8,
}
pub type std_allocator_traits__Ptr_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits__Diff {
    pub _address: u8,
}
pub type std_allocator_traits__Diff_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits__Size {
    pub _address: u8,
}
pub type std_allocator_traits_const_pointer = u8;
pub type std_allocator_traits_void_pointer = u8;
pub type std_allocator_traits_const_void_pointer = u8;
pub type std_allocator_traits_difference_type = u8;
pub type std_allocator_traits_size_type = u8;
pub type std_allocator_traits_propagate_on_container_copy_assignment = u8;
pub type std_allocator_traits_propagate_on_container_move_assignment = u8;
pub type std_allocator_traits_propagate_on_container_swap = u8;
pub type std_allocator_traits_is_always_equal = u8;
pub type std_allocator_traits_rebind_alloc = u8;
pub type std_allocator_traits_rebind_traits = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits___construct_helper {
    pub _address: u8,
}
pub type std_allocator_traits___construct_helper_type = u8;
pub type std_allocator_traits___has_construct = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_alloc_insertable_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_copy_insertable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_move_insertable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_allocator {
    pub _address: u8,
}
pub type std__RequireAllocator = u8;
pub type std__RequireNotAllocator = u8;
extern "C" {
    #[link_name = "\u{1}_ZSt7getlineIcSt11char_traitsIcESaIcEERSt13basic_istreamIT_T0_ES7_RNSt7__cxx1112basic_stringIS4_S5_T1_EES4_"]
    pub fn std_getline(
        ___in: *mut u8,
        __str: *mut [u64; 4usize],
        __delim: ::std::os::raw::c_char,
    ) -> *mut u8;
}
extern "C" {
    #[link_name = "\u{1}_ZSt7getlineIwSt11char_traitsIwESaIwEERSt13basic_istreamIT_T0_ES7_RNSt7__cxx1112basic_stringIS4_S5_T1_EES4_"]
    pub fn std_getline1(___in: *mut u8, __str: *mut [u64; 4usize], __delim: u16) -> *mut u8;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std___detail__List_node_base {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std___detail__List_node_base() {
    assert_eq!(
        ::std::mem::size_of::<std___detail__List_node_base>(),
        16usize,
        concat!("Size of: ", stringify!(std___detail__List_node_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___detail__List_node_base>(),
        8usize,
        concat!("Alignment of ", stringify!(std___detail__List_node_base))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base4swapERS0_S1_"]
    pub fn std___detail__List_node_base_swap(
        __x: *mut std___detail__List_node_base,
        __y: *mut std___detail__List_node_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base11_M_transferEPS0_S1_"]
    pub fn std___detail__List_node_base__M_transfer(
        this: *mut std___detail__List_node_base,
        __first: *mut std___detail__List_node_base,
        __last: *mut std___detail__List_node_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base10_M_reverseEv"]
    pub fn std___detail__List_node_base__M_reverse(this: *mut std___detail__List_node_base);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base7_M_hookEPS0_"]
    pub fn std___detail__List_node_base__M_hook(
        this: *mut std___detail__List_node_base,
        __position: *mut std___detail__List_node_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base9_M_unhookEv"]
    pub fn std___detail__List_node_base__M_unhook(this: *mut std___detail__List_node_base);
}
impl std___detail__List_node_base {
    #[inline]
    pub unsafe fn swap(
        __x: *mut std___detail__List_node_base,
        __y: *mut std___detail__List_node_base,
    ) {
        std___detail__List_node_base_swap(__x, __y)
    }
    #[inline]
    pub unsafe fn _M_transfer(
        &mut self,
        __first: *mut std___detail__List_node_base,
        __last: *mut std___detail__List_node_base,
    ) {
        std___detail__List_node_base__M_transfer(self, __first, __last)
    }
    #[inline]
    pub unsafe fn _M_reverse(&mut self) {
        std___detail__List_node_base__M_reverse(self)
    }
    #[inline]
    pub unsafe fn _M_hook(&mut self, __position: *mut std___detail__List_node_base) {
        std___detail__List_node_base__M_hook(self, __position)
    }
    #[inline]
    pub unsafe fn _M_unhook(&mut self) {
        std___detail__List_node_base__M_unhook(self)
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std___detail__List_node_header {
    pub _bindgen_opaque_blob: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_std___detail__List_node_header() {
    assert_eq!(
        ::std::mem::size_of::<std___detail__List_node_header>(),
        24usize,
        concat!("Size of: ", stringify!(std___detail__List_node_header))
    );
    assert_eq!(
        ::std::mem::align_of::<std___detail__List_node_header>(),
        8usize,
        concat!("Alignment of ", stringify!(std___detail__List_node_header))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_base {
    pub _address: u8,
}
pub type std___hash_base_result_type = u8;
pub type std___hash_base_argument_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___poison_hash {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_hash {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std__Hash_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std__Hash_impl() {
    assert_eq!(
        ::std::mem::size_of::<std__Hash_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std__Hash_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Hash_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std__Hash_impl))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std__Fnv_hash_impl {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std__Fnv_hash_impl() {
    assert_eq!(
        ::std::mem::size_of::<std__Fnv_hash_impl>(),
        1usize,
        concat!("Size of: ", stringify!(std__Fnv_hash_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Fnv_hash_impl>(),
        1usize,
        concat!("Alignment of ", stringify!(std__Fnv_hash_impl))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_fast_hash {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}npos"]
    pub static std_npos: std_basic_string_size_type;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std___cow_string {
    pub _bindgen_opaque_blob: u64,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union std___cow_string__bindgen_ty_1 {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std___cow_string__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<std___cow_string__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(std___cow_string__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<std___cow_string__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(std___cow_string__bindgen_ty_1))
    );
}
#[test]
fn bindgen_test_layout_std___cow_string() {
    assert_eq!(
        ::std::mem::size_of::<std___cow_string>(),
        8usize,
        concat!("Size of: ", stringify!(std___cow_string))
    );
    assert_eq!(
        ::std::mem::align_of::<std___cow_string>(),
        8usize,
        concat!("Alignment of ", stringify!(std___cow_string))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1Ev"]
    pub fn std___cow_string___cow_string(this: *mut std___cow_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std___cow_string___cow_string1(this: *mut std___cow_string, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1EPKcy"]
    pub fn std___cow_string___cow_string2(
        this: *mut std___cow_string,
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1ERKS_"]
    pub fn std___cow_string___cow_string3(
        this: *mut std___cow_string,
        arg1: *const std___cow_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1EOS_"]
    pub fn std___cow_string___cow_string4(this: *mut std___cow_string, arg1: *mut std___cow_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringD1Ev"]
    pub fn std___cow_string___cow_string_destructor(this: *mut std___cow_string);
}
impl std___cow_string {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *const ::std::os::raw::c_char, arg2: usize) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string2(__bindgen_tmp.as_mut_ptr(), arg1, arg2);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std___cow_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(arg1: *mut std___cow_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string4(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___cow_string___cow_string_destructor(self)
    }
}
pub type std___sso_string = [u64; 4usize];
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_logic_error {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_logic_error() {
    assert_eq!(
        ::std::mem::size_of::<std_logic_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_logic_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_logic_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_logic_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_logic_error_logic_error(this: *mut std_logic_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1EPKc"]
    pub fn std_logic_error_logic_error1(
        this: *mut std_logic_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1EOS_"]
    pub fn std_logic_error_logic_error2(this: *mut std_logic_error, arg1: *mut std_logic_error);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1ERKS_"]
    pub fn std_logic_error_logic_error3(this: *mut std_logic_error, arg1: *const std_logic_error);
}
impl std_logic_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *mut std_logic_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std_logic_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorD1Ev"]
    pub fn std_logic_error_logic_error_destructor(this: *mut std_logic_error);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt11logic_error4whatEv"]
    pub fn std_logic_error_what(this: *mut ::std::os::raw::c_void)
        -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_domain_error {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_domain_error() {
    assert_eq!(
        ::std::mem::size_of::<std_domain_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_domain_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_domain_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_domain_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12domain_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_domain_error_domain_error(this: *mut std_domain_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12domain_errorC1EPKc"]
    pub fn std_domain_error_domain_error1(
        this: *mut std_domain_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_domain_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_domain_error_domain_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_domain_error_domain_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12domain_errorD1Ev"]
    pub fn std_domain_error_domain_error_destructor(this: *mut std_domain_error);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_invalid_argument {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_invalid_argument() {
    assert_eq!(
        ::std::mem::size_of::<std_invalid_argument>(),
        16usize,
        concat!("Size of: ", stringify!(std_invalid_argument))
    );
    assert_eq!(
        ::std::mem::align_of::<std_invalid_argument>(),
        8usize,
        concat!("Alignment of ", stringify!(std_invalid_argument))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16invalid_argumentC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_invalid_argument_invalid_argument(
        this: *mut std_invalid_argument,
        __arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16invalid_argumentC1EPKc"]
    pub fn std_invalid_argument_invalid_argument1(
        this: *mut std_invalid_argument,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_invalid_argument {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_invalid_argument_invalid_argument(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_invalid_argument_invalid_argument1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16invalid_argumentD1Ev"]
    pub fn std_invalid_argument_invalid_argument_destructor(this: *mut std_invalid_argument);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_length_error {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_length_error() {
    assert_eq!(
        ::std::mem::size_of::<std_length_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_length_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_length_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_length_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12length_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_length_error_length_error(this: *mut std_length_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12length_errorC1EPKc"]
    pub fn std_length_error_length_error1(
        this: *mut std_length_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_length_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_length_error_length_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_length_error_length_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12length_errorD1Ev"]
    pub fn std_length_error_length_error_destructor(this: *mut std_length_error);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_out_of_range {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_out_of_range() {
    assert_eq!(
        ::std::mem::size_of::<std_out_of_range>(),
        16usize,
        concat!("Size of: ", stringify!(std_out_of_range))
    );
    assert_eq!(
        ::std::mem::align_of::<std_out_of_range>(),
        8usize,
        concat!("Alignment of ", stringify!(std_out_of_range))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12out_of_rangeC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_out_of_range_out_of_range(this: *mut std_out_of_range, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12out_of_rangeC1EPKc"]
    pub fn std_out_of_range_out_of_range1(
        this: *mut std_out_of_range,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_out_of_range {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_out_of_range_out_of_range(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_out_of_range_out_of_range1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12out_of_rangeD1Ev"]
    pub fn std_out_of_range_out_of_range_destructor(this: *mut std_out_of_range);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_runtime_error {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_runtime_error() {
    assert_eq!(
        ::std::mem::size_of::<std_runtime_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_runtime_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_runtime_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_runtime_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_runtime_error_runtime_error(this: *mut std_runtime_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1EPKc"]
    pub fn std_runtime_error_runtime_error1(
        this: *mut std_runtime_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1EOS_"]
    pub fn std_runtime_error_runtime_error2(
        this: *mut std_runtime_error,
        arg1: *mut std_runtime_error,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1ERKS_"]
    pub fn std_runtime_error_runtime_error3(
        this: *mut std_runtime_error,
        arg1: *const std_runtime_error,
    );
}
impl std_runtime_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *mut std_runtime_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std_runtime_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorD1Ev"]
    pub fn std_runtime_error_runtime_error_destructor(this: *mut std_runtime_error);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt13runtime_error4whatEv"]
    pub fn std_runtime_error_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_range_error {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_range_error() {
    assert_eq!(
        ::std::mem::size_of::<std_range_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_range_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_range_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_range_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11range_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_range_error_range_error(this: *mut std_range_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11range_errorC1EPKc"]
    pub fn std_range_error_range_error1(
        this: *mut std_range_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_range_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_range_error_range_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_range_error_range_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11range_errorD1Ev"]
    pub fn std_range_error_range_error_destructor(this: *mut std_range_error);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_overflow_error {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_overflow_error() {
    assert_eq!(
        ::std::mem::size_of::<std_overflow_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_overflow_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_overflow_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_overflow_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt14overflow_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_overflow_error_overflow_error(
        this: *mut std_overflow_error,
        __arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt14overflow_errorC1EPKc"]
    pub fn std_overflow_error_overflow_error1(
        this: *mut std_overflow_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_overflow_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_overflow_error_overflow_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_overflow_error_overflow_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt14overflow_errorD1Ev"]
    pub fn std_overflow_error_overflow_error_destructor(this: *mut std_overflow_error);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_underflow_error {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_underflow_error() {
    assert_eq!(
        ::std::mem::size_of::<std_underflow_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_underflow_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_underflow_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_underflow_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15underflow_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_underflow_error_underflow_error(
        this: *mut std_underflow_error,
        __arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15underflow_errorC1EPKc"]
    pub fn std_underflow_error_underflow_error1(
        this: *mut std_underflow_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_underflow_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_underflow_error_underflow_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_underflow_error_underflow_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15underflow_errorD1Ev"]
    pub fn std_underflow_error_underflow_error_destructor(this: *mut std_underflow_error);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_code_enum {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_condition_enum {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_error_category {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_error_category() {
    assert_eq!(
        ::std::mem::size_of::<std_error_category>(),
        8usize,
        concat!("Size of: ", stringify!(std_error_category))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_category>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_category))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt3_V214error_categoryD1Ev"]
    pub fn std_error_category_error_category_destructor(this: *mut std_error_category);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt3_V214error_category23default_error_conditionEi"]
    pub fn std_error_category_default_error_condition(
        this: *mut ::std::os::raw::c_void,
        __i: ::std::os::raw::c_int,
    ) -> std_error_condition;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt3_V214error_category10equivalentEiRKSt15error_condition"]
    pub fn std_error_category_equivalent(
        this: *mut ::std::os::raw::c_void,
        __i: ::std::os::raw::c_int,
        __cond: *const std_error_condition,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt3_V214error_category10equivalentERKSt10error_codei"]
    pub fn std_error_category_equivalent1(
        this: *mut ::std::os::raw::c_void,
        __code: *const std_error_code,
        __i: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt3_V216generic_categoryEv"]
    pub fn std_generic_category() -> *const std_error_category;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt3_V215system_categoryEv"]
    pub fn std_system_category() -> *const std_error_category;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_error_code {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_error_code() {
    assert_eq!(
        ::std::mem::size_of::<std_error_code>(),
        16usize,
        concat!("Size of: ", stringify!(std_error_code))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_code>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_code))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt10error_code23default_error_conditionEv"]
    pub fn std_error_code_default_error_condition(
        this: *const std_error_code,
    ) -> std_error_condition;
}
impl std_error_code {
    #[inline]
    pub unsafe fn default_error_condition(&self) -> std_error_condition {
        std_error_code_default_error_condition(self)
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_error_condition {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std_error_condition() {
    assert_eq!(
        ::std::mem::size_of::<std_error_condition>(),
        16usize,
        concat!("Size of: ", stringify!(std_error_condition))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_condition>(),
        8usize,
        concat!("Alignment of ", stringify!(std_error_condition))
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_system_error {
    pub _bindgen_opaque_blob: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_std_system_error() {
    assert_eq!(
        ::std::mem::size_of::<std_system_error>(),
        32usize,
        concat!("Size of: ", stringify!(std_system_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_system_error>(),
        8usize,
        concat!("Alignment of ", stringify!(std_system_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12system_errorD1Ev"]
    pub fn std_system_error_system_error_destructor(this: *mut std_system_error);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std___mutex_base {
    pub _bindgen_opaque_blob: u64,
}
pub type std___mutex_base___native_type = u64;
#[test]
fn bindgen_test_layout_std___mutex_base() {
    assert_eq!(
        ::std::mem::size_of::<std___mutex_base>(),
        8usize,
        concat!("Size of: ", stringify!(std___mutex_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___mutex_base>(),
        8usize,
        concat!("Alignment of ", stringify!(std___mutex_base))
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_mutex {
    pub _bindgen_opaque_blob: u64,
}
pub type std_mutex_native_handle_type = u64;
#[test]
fn bindgen_test_layout_std_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_mutex>(),
        8usize,
        concat!("Size of: ", stringify!(std_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_mutex))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_defer_lock_t {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_defer_lock_t() {
    assert_eq!(
        ::std::mem::size_of::<std_defer_lock_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_defer_lock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_defer_lock_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_defer_lock_t))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_try_to_lock_t {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_try_to_lock_t() {
    assert_eq!(
        ::std::mem::size_of::<std_try_to_lock_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_try_to_lock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_try_to_lock_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_try_to_lock_t))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_adopt_lock_t {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_adopt_lock_t() {
    assert_eq!(
        ::std::mem::size_of::<std_adopt_lock_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_adopt_lock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_adopt_lock_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_adopt_lock_t))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZStL10defer_lock"]
    pub static std_defer_lock: std_defer_lock_t;
}
extern "C" {
    #[link_name = "\u{1}_ZStL11try_to_lock"]
    pub static std_try_to_lock: std_try_to_lock_t;
}
extern "C" {
    #[link_name = "\u{1}_ZStL10adopt_lock"]
    pub static std_adopt_lock: std_adopt_lock_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_lock_guard {
    pub _address: u8,
}
pub type std_lock_guard_mutex_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_lock {
    pub _address: u8,
}
pub type std_unique_lock_mutex_type = u8;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std___recursive_mutex_base {
    pub _bindgen_opaque_blob: u64,
}
pub type std___recursive_mutex_base___native_type = u64;
#[test]
fn bindgen_test_layout_std___recursive_mutex_base() {
    assert_eq!(
        ::std::mem::size_of::<std___recursive_mutex_base>(),
        8usize,
        concat!("Size of: ", stringify!(std___recursive_mutex_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___recursive_mutex_base>(),
        8usize,
        concat!("Alignment of ", stringify!(std___recursive_mutex_base))
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_recursive_mutex {
    pub _bindgen_opaque_blob: u64,
}
pub type std_recursive_mutex_native_handle_type = u64;
#[test]
fn bindgen_test_layout_std_recursive_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_recursive_mutex>(),
        8usize,
        concat!("Size of: ", stringify!(std_recursive_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_recursive_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_recursive_mutex))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___timed_mutex_impl {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_timed_mutex {
    pub _bindgen_opaque_blob: u64,
}
pub type std_timed_mutex_native_handle_type = u64;
#[test]
fn bindgen_test_layout_std_timed_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_timed_mutex>(),
        8usize,
        concat!("Size of: ", stringify!(std_timed_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_timed_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_timed_mutex))
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_recursive_timed_mutex {
    pub _bindgen_opaque_blob: u64,
}
pub type std_recursive_timed_mutex_native_handle_type = u64;
#[test]
fn bindgen_test_layout_std_recursive_timed_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_recursive_timed_mutex>(),
        8usize,
        concat!("Size of: ", stringify!(std_recursive_timed_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_recursive_timed_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(std_recursive_timed_mutex))
    );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_once_flag {
    pub _bindgen_opaque_blob: u32,
}
pub type std_once_flag___native_type = u32;
#[test]
fn bindgen_test_layout_std_once_flag() {
    assert_eq!(
        ::std::mem::size_of::<std_once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(std_once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(std_once_flag))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt15__once_callable"]
    pub static mut std___once_callable: *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZSt11__once_call"]
    pub static mut std___once_call: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    #[link_name = "\u{1}__once_proxy"]
    pub fn std___once_proxy();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_bitwise_relocatable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_base {
    pub _address: u8,
}
pub type std__Vector_base__Tp_alloc_type = u8;
pub type std__Vector_base_pointer = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_base__Vector_impl_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_base__Vector_impl {
    pub _address: u8,
}
pub type std__Vector_base_allocator_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector {
    pub _address: u8,
}
pub type std_vector__Base = u8;
pub type std_vector__Tp_alloc_type = u8;
pub type std_vector__Alloc_traits = u8;
pub type std_vector_value_type = u8;
pub type std_vector_pointer = u8;
pub type std_vector_const_pointer = u8;
pub type std_vector_reference = u8;
pub type std_vector_const_reference = u8;
pub type std_vector_iterator = u8;
pub type std_vector_const_iterator = u8;
pub type std_vector_const_reverse_iterator = u8;
pub type std_vector_reverse_iterator = u8;
pub type std_vector_size_type = u64;
pub type std_vector_difference_type = u64;
pub type std_vector_allocator_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector__Temporary_value {
    pub _address: u8,
}
pub type std__Bit_type = u32;
pub const _S_word_bit: std__bindgen_ty_1 = 32;
pub type std__bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std__Bit_reference {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std__Bit_reference() {
    assert_eq!(
        ::std::mem::size_of::<std__Bit_reference>(),
        16usize,
        concat!("Size of: ", stringify!(std__Bit_reference))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Bit_reference>(),
        8usize,
        concat!("Alignment of ", stringify!(std__Bit_reference))
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std__Bit_iterator_base {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_std__Bit_iterator_base() {
    assert_eq!(
        ::std::mem::size_of::<std__Bit_iterator_base>(),
        16usize,
        concat!("Size of: ", stringify!(std__Bit_iterator_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Bit_iterator_base>(),
        8usize,
        concat!("Alignment of ", stringify!(std__Bit_iterator_base))
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std__Bit_iterator {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
pub type std__Bit_iterator_reference = [u64; 2usize];
pub type std__Bit_iterator_pointer = u64;
#[test]
fn bindgen_test_layout_std__Bit_iterator() {
    assert_eq!(
        ::std::mem::size_of::<std__Bit_iterator>(),
        16usize,
        concat!("Size of: ", stringify!(std__Bit_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Bit_iterator>(),
        8usize,
        concat!("Alignment of ", stringify!(std__Bit_iterator))
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std__Bit_const_iterator {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
pub type std__Bit_const_iterator_reference = u8;
pub type std__Bit_const_iterator_const_reference = u8;
pub type std__Bit_const_iterator_pointer = u64;
#[test]
fn bindgen_test_layout_std__Bit_const_iterator() {
    assert_eq!(
        ::std::mem::size_of::<std__Bit_const_iterator>(),
        16usize,
        concat!("Size of: ", stringify!(std__Bit_const_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Bit_const_iterator>(),
        8usize,
        concat!("Alignment of ", stringify!(std__Bit_const_iterator))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bvector_base {
    pub _address: u8,
}
pub type std__Bvector_base__Bit_alloc_type = u8;
pub type std__Bvector_base__Bit_alloc_traits = u8;
pub type std__Bvector_base__Bit_pointer = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bvector_base__Bvector_impl_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bvector_base__Bvector_impl {
    pub _address: u8,
}
pub type std__Bvector_base_allocator_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocated_ptr {
    pub _address: u8,
}
pub type std___allocated_ptr_pointer = u8;
pub type std___allocated_ptr_value_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_node {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_iterator {
    pub _address: u8,
}
pub type std__List_iterator__Self = u8;
pub type std__List_iterator__Node = u8;
pub type std__List_iterator_difference_type = u64;
pub type std__List_iterator_iterator_category = u8;
pub type std__List_iterator_value_type = u8;
pub type std__List_iterator_pointer = u8;
pub type std__List_iterator_reference = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_const_iterator {
    pub _address: u8,
}
pub type std__List_const_iterator__Self = u8;
pub type std__List_const_iterator__Node = u8;
pub type std__List_const_iterator_iterator = u8;
pub type std__List_const_iterator_difference_type = u64;
pub type std__List_const_iterator_iterator_category = u8;
pub type std__List_const_iterator_value_type = u8;
pub type std__List_const_iterator_pointer = u8;
pub type std__List_const_iterator_reference = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Temporary_buffer {
    pub _address: u8,
}
pub type std__Temporary_buffer_value_type = u8;
pub type std__Temporary_buffer_pointer = u8;
pub type std__Temporary_buffer_iterator = u8;
pub type std__Temporary_buffer_size_type = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_raw_storage_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uniq_ptr_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uniq_ptr_impl__Ptr {
    pub _address: u8,
}
pub type std___uniq_ptr_impl__Ptr_type = u8;
pub type std___uniq_ptr_impl__DeleterConstraint = u8;
pub type std___uniq_ptr_impl_pointer = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_ptr {
    pub _address: u8,
}
pub type std_unique_ptr__DeleterConstraint = u8;
pub type std_unique_ptr_pointer = u8;
pub type std_unique_ptr_element_type = u8;
pub type std_unique_ptr_deleter_type = u8;
pub type std_unique_ptr___safe_conversion_up = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__MakeUniq {
    pub _address: u8,
}
pub type std__MakeUniq___single_object = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Maybe_unary_or_binary_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Mem_fn_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Mem_fn_traits_base {
    pub _address: u8,
}
pub type std__Mem_fn_traits_base___result_type = u8;
pub type std__Mem_fn_traits_base___maybe_type = u8;
pub type std__Mem_fn_traits_base___arity = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Maybe_get_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Weak_result_type_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Weak_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Refwrap_base_arg1 {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Refwrap_base_arg2 {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Reference_wrapper_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reference_wrapper {
    pub _address: u8,
}
pub type std_reference_wrapper___not_same = u8;
pub type std_reference_wrapper_type = u8;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_weak_ptr {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_bad_weak_ptr() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_weak_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_weak_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_weak_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_weak_ptr))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt12bad_weak_ptr4whatEv"]
    pub fn std_bad_weak_ptr_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12bad_weak_ptrD1Ev"]
    pub fn std_bad_weak_ptr_bad_weak_ptr_destructor(this: *mut std_bad_weak_ptr);
}
pub const std__Mutex_base__S_need_barriers: std__Mutex_base__bindgen_ty_1 = 0;
pub type std__Mutex_base__bindgen_ty_1 = i32;
extern "C" {
    #[link_name = "\u{1}_M_add_ref_lock"]
    pub fn std__Sp_counted_base__M_add_ref_lock(this: *mut u8);
}
extern "C" {
    #[link_name = "\u{1}_M_add_ref_lock_nothrow"]
    pub fn std__Sp_counted_base__M_add_ref_lock_nothrow(this: *mut u8) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_owner_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_counted_deleter__Impl {
    pub _address: u8,
}
pub type std__Sp_counted_deleter__Impl__Del_base = u8;
pub type std__Sp_counted_deleter__Impl__Alloc_base = u8;
pub type std__Sp_counted_deleter___allocator_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_make_shared_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std__Sp_make_shared_tag() {
    assert_eq!(
        ::std::mem::size_of::<std__Sp_make_shared_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std__Sp_make_shared_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Sp_make_shared_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std__Sp_make_shared_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_alloc_shared_tag {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_counted_ptr_inplace__Impl {
    pub _address: u8,
}
pub type std__Sp_counted_ptr_inplace__Impl__A_base = u8;
pub type std__Sp_counted_ptr_inplace___allocator_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___sp_array_delete {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___sp_array_delete() {
    assert_eq!(
        ::std::mem::size_of::<std___sp_array_delete>(),
        1usize,
        concat!("Size of: ", stringify!(std___sp_array_delete))
    );
    assert_eq!(
        ::std::mem::align_of::<std___sp_array_delete>(),
        1usize,
        concat!("Alignment of ", stringify!(std___sp_array_delete))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___shared_count___not_alloc_shared_tag {
    pub _address: u8,
}
pub type std___shared_count___not_alloc_shared_tag_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___sp_compatible_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___sp_is_constructible_arr {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___sp_is_constructible {
    pub _address: u8,
}
pub type std___shared_ptr_access_element_type = u8;
pub type std___shared_ptr_element_type = u8;
pub type std___shared_ptr__SafeConv = u8;
pub type std___shared_ptr__Compatible = u8;
pub type std___shared_ptr__Assignable = u8;
pub type std___shared_ptr__UniqCompatible = u8;
pub type std___shared_ptr__UniqAssignable = u8;
pub type std___shared_ptr___esft_base_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___shared_ptr___has_esft_base {
    pub _address: u8,
}
pub type std___weak_ptr__Compatible = u8;
pub type std___weak_ptr__Assignable = u8;
pub type std___weak_ptr_element_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_owner_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_shared_ptr {
    pub _address: u8,
}
pub type std_shared_ptr__Constructible = u8;
pub type std_shared_ptr__Assignable = u8;
pub type std_shared_ptr_element_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_weak_ptr {
    pub _address: u8,
}
pub type std_weak_ptr__Constructible = u8;
pub type std_weak_ptr__Assignable = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_enable_shared_from_this {
    pub _address: u8,
}
pub const std_memory_order_memory_order_relaxed: std_memory_order = 0;
pub const std_memory_order_memory_order_consume: std_memory_order = 1;
pub const std_memory_order_memory_order_acquire: std_memory_order = 2;
pub const std_memory_order_memory_order_release: std_memory_order = 3;
pub const std_memory_order_memory_order_acq_rel: std_memory_order = 4;
pub const std_memory_order_memory_order_seq_cst: std_memory_order = 5;
pub type std_memory_order = ::std::os::raw::c_uint;
pub const std___memory_order_modifier___memory_order_mask: std___memory_order_modifier = 65535;
pub const std___memory_order_modifier___memory_order_modifier_mask: std___memory_order_modifier =
    4294901760;
pub const std___memory_order_modifier___memory_order_hle_acquire: std___memory_order_modifier =
    65536;
pub const std___memory_order_modifier___memory_order_hle_release: std___memory_order_modifier =
    131072;
pub type std___memory_order_modifier = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic {
    pub _address: u8,
}
pub type std___atomic_flag_data_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std___atomic_flag_base {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std___atomic_flag_base() {
    assert_eq!(
        ::std::mem::size_of::<std___atomic_flag_base>(),
        1usize,
        concat!("Size of: ", stringify!(std___atomic_flag_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___atomic_flag_base>(),
        1usize,
        concat!("Alignment of ", stringify!(std___atomic_flag_base))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic_flag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_atomic_flag() {
    assert_eq!(
        ::std::mem::size_of::<std_atomic_flag>(),
        1usize,
        concat!("Size of: ", stringify!(std_atomic_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_atomic_flag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_atomic_flag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___atomic_base {
    pub _address: u8,
}
pub type std___atomic_base_value_type = u8;
pub type std___atomic_base_difference_type = u8;
pub type std___atomic_base___int_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_locker {
    pub _bindgen_opaque_blob: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_std__Sp_locker() {
    assert_eq!(
        ::std::mem::size_of::<std__Sp_locker>(),
        2usize,
        concat!("Size of: ", stringify!(std__Sp_locker))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Sp_locker>(),
        1usize,
        concat!("Alignment of ", stringify!(std__Sp_locker))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10_Sp_lockerC1EPKv"]
    pub fn std__Sp_locker__Sp_locker(
        this: *mut std__Sp_locker,
        arg1: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10_Sp_lockerC1EPKvS1_"]
    pub fn std__Sp_locker__Sp_locker1(
        this: *mut std__Sp_locker,
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10_Sp_lockerD1Ev"]
    pub fn std__Sp_locker__Sp_locker_destructor(this: *mut std__Sp_locker);
}
impl std__Sp_locker {
    #[inline]
    pub unsafe fn new(arg1: *const ::std::os::raw::c_void) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std__Sp_locker__Sp_locker(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std__Sp_locker__Sp_locker1(__bindgen_tmp.as_mut_ptr(), arg1, arg2);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std__Sp_locker__Sp_locker_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_auto_ptr_ref {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_auto_ptr {
    pub _address: u8,
}
pub type std_auto_ptr_element_type = u8;
pub const std_pointer_safety_relaxed: std_pointer_safety = 0;
pub const std_pointer_safety_preferred: std_pointer_safety = 1;
pub const std_pointer_safety_strict: std_pointer_safety = 2;
pub type std_pointer_safety = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_thread {
    pub _bindgen_opaque_blob: u64,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__State {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_thread__State() {
    assert_eq!(
        ::std::mem::size_of::<std_thread__State>(),
        8usize,
        concat!("Size of: ", stringify!(std_thread__State))
    );
    assert_eq!(
        ::std::mem::align_of::<std_thread__State>(),
        8usize,
        concat!("Alignment of ", stringify!(std_thread__State))
    );
}
pub type std_thread__State_ptr = u64;
pub type std_thread_native_handle_type = u64;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_thread_id {
    pub _bindgen_opaque_blob: u64,
}
#[test]
fn bindgen_test_layout_std_thread_id() {
    assert_eq!(
        ::std::mem::size_of::<std_thread_id>(),
        8usize,
        concat!("Size of: ", stringify!(std_thread_id))
    );
    assert_eq!(
        ::std::mem::align_of::<std_thread_id>(),
        8usize,
        concat!("Alignment of ", stringify!(std_thread_id))
    );
}
pub type std_thread___not_same = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__State_impl {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__Invoker {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__Invoker___result {
    pub _address: u8,
}
pub type std_thread___decayed_tuple = u8;
#[test]
fn bindgen_test_layout_std_thread() {
    assert_eq!(
        ::std::mem::size_of::<std_thread>(),
        8usize,
        concat!("Size of: ", stringify!(std_thread))
    );
    assert_eq!(
        ::std::mem::align_of::<std_thread>(),
        8usize,
        concat!("Alignment of ", stringify!(std_thread))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread4joinEv"]
    pub fn std_thread_join(this: *mut std_thread);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread6detachEv"]
    pub fn std_thread_detach(this: *mut std_thread);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread20hardware_concurrencyEv"]
    pub fn std_thread_hardware_concurrency() -> ::std::os::raw::c_uint;
}
impl std_thread {
    #[inline]
    pub unsafe fn join(&mut self) {
        std_thread_join(self)
    }
    #[inline]
    pub unsafe fn detach(&mut self) {
        std_thread_detach(self)
    }
    #[inline]
    pub unsafe fn hardware_concurrency() -> ::std::os::raw::c_uint {
        std_thread_hardware_concurrency()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread6_StateD1Ev"]
    pub fn std_thread__State__State_destructor(this: *mut std_thread__State);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11this_thread11__sleep_forENSt6chrono8durationIxSt5ratioILx1ELx1EEEENS1_IxS2_ILx1ELx1000000000EEEE"]
    pub fn std_this_thread___sleep_for(arg1: std_chrono_seconds, arg2: std_chrono_nanoseconds);
}
pub type __gnu_cxx___conditional_type___type<_Iftrue> = _Iftrue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___add_unsigned {
    pub _address: u8,
}
pub type __gnu_cxx___add_unsigned___if_type = u8;
pub type __gnu_cxx___add_unsigned___type = __gnu_cxx___add_unsigned___if_type;
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___remove_unsigned {
    pub _address: u8,
}
pub type __gnu_cxx___remove_unsigned___if_type = u8;
pub type __gnu_cxx___remove_unsigned___type = __gnu_cxx___remove_unsigned___if_type;
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_long_long_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
pub type __gnu_cxx___promote___type = f64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_2 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_2___type<_Tp2> = _Tp2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_3 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_3___type<_Tp2> = _Tp2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_4 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_4___type<_Tp2> = _Tp2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___is_integer_nonstrict {
    pub _address: u8,
}
pub const __gnu_cxx___is_integer_nonstrict___width: __gnu_cxx___is_integer_nonstrict__bindgen_ty_1 =
    0;
pub type __gnu_cxx___is_integer_nonstrict__bindgen_ty_1 = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___numeric_traits_integer {
    pub _address: u8,
}
// extern "C" {
//     #[link_name = "\u{1}__min"]
//     pub static __gnu_cxx___min: _Value;
// }
// extern "C" {
//     #[link_name = "\u{1}__max"]
//     pub static __gnu_cxx___max: _Value;
// }
extern "C" {
    #[link_name = "\u{1}__is_signed"]
    pub static __gnu_cxx___is_signed: bool;
}
extern "C" {
    #[link_name = "\u{1}__digits"]
    pub static __gnu_cxx___digits: ::std::os::raw::c_int;
}
#[test]
fn __bindgen_test_layout___gnu_cxx___is_integer_nonstrict_open0___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___is_integer_nonstrict>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___is_integer_nonstrict)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___is_integer_nonstrict>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___is_integer_nonstrict)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___is_integer_nonstrict_open0_unsigned___int128_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___is_integer_nonstrict>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___is_integer_nonstrict)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___is_integer_nonstrict>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___is_integer_nonstrict)
        )
    );
}
pub type __gnu_cxx___int_traits = __gnu_cxx___numeric_traits_integer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___numeric_traits_floating {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}__max_digits10"]
    pub static __gnu_cxx___max_digits10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__digits10"]
    pub static __gnu_cxx___digits10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__max_exponent10"]
    pub static __gnu_cxx___max_exponent10: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___numeric_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___normal_iterator<_Iterator> {
    pub _M_current: _Iterator,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
}
pub type __gnu_cxx___normal_iterator___traits_type = u8;
pub type __gnu_cxx___normal_iterator_iterator_type<_Iterator> = _Iterator;
pub type __gnu_cxx___normal_iterator_iterator_category = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_value_type = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_difference_type = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_reference = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_pointer = __gnu_cxx___normal_iterator___traits_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_less_iter {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout___gnu_cxx___ops__Iter_less_iter() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___ops__Iter_less_iter>(),
        1usize,
        concat!("Size of: ", stringify!(__gnu_cxx___ops__Iter_less_iter))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___ops__Iter_less_iter>(),
        1usize,
        concat!("Alignment of ", stringify!(__gnu_cxx___ops__Iter_less_iter))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_less_val {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout___gnu_cxx___ops__Iter_less_val() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___ops__Iter_less_val>(),
        1usize,
        concat!("Size of: ", stringify!(__gnu_cxx___ops__Iter_less_val))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___ops__Iter_less_val>(),
        1usize,
        concat!("Alignment of ", stringify!(__gnu_cxx___ops__Iter_less_val))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Val_less_iter {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout___gnu_cxx___ops__Val_less_iter() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___ops__Val_less_iter>(),
        1usize,
        concat!("Size of: ", stringify!(__gnu_cxx___ops__Val_less_iter))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___ops__Val_less_iter>(),
        1usize,
        concat!("Alignment of ", stringify!(__gnu_cxx___ops__Val_less_iter))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_equal_to_iter {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout___gnu_cxx___ops__Iter_equal_to_iter() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___ops__Iter_equal_to_iter>(),
        1usize,
        concat!("Size of: ", stringify!(__gnu_cxx___ops__Iter_equal_to_iter))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___ops__Iter_equal_to_iter>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(__gnu_cxx___ops__Iter_equal_to_iter)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_equal_to_val {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout___gnu_cxx___ops__Iter_equal_to_val() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___ops__Iter_equal_to_val>(),
        1usize,
        concat!("Size of: ", stringify!(__gnu_cxx___ops__Iter_equal_to_val))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___ops__Iter_equal_to_val>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(__gnu_cxx___ops__Iter_equal_to_val)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_comp_iter<_Compare> {
    pub _M_comp: _Compare,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_comp_val<_Compare> {
    pub _M_comp: _Compare,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Val_comp_iter<_Compare> {
    pub _M_comp: _Compare,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_equals_val<_Value> {
    pub _M_value: *mut _Value,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Value>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_equals_iter<_Iterator1> {
    pub _M_it1: _Iterator1,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator1>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_pred<_Predicate> {
    pub _M_pred: _Predicate,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_comp_to_val<_Compare, _Value> {
    pub _M_comp: _Compare,
    pub _M_value: *mut _Value,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Value>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_comp_to_iter<_Compare, _Iterator1> {
    pub _M_comp: _Compare,
    pub _M_it1: _Iterator1,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator1>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___ops__Iter_negate<_Predicate> {
    pub _M_pred: _Predicate,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
}
extern "C" {
    #[link_name = "\u{1}_ZN9__gnu_cxx27__verbose_terminate_handlerEv"]
    pub fn __gnu_cxx___verbose_terminate_handler();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx__Char_types {
    pub _address: u8,
}
pub type __gnu_cxx__Char_types_int_type = ::std::os::raw::c_ulong;
pub type __gnu_cxx__Char_types_pos_type = std_streampos;
pub type __gnu_cxx__Char_types_off_type = std_streamoff;
pub type __gnu_cxx__Char_types_state_type = mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx_char_traits {
    pub _address: u8,
}
pub type __gnu_cxx_char_traits_char_type<_CharT> = _CharT;
pub type __gnu_cxx_char_traits_int_type = __gnu_cxx__Char_types;
pub type __gnu_cxx_char_traits_pos_type = __gnu_cxx__Char_types;
pub type __gnu_cxx_char_traits_off_type = __gnu_cxx__Char_types;
pub type __gnu_cxx_char_traits_state_type = __gnu_cxx__Char_types;
#[repr(C)]
#[derive(Debug)]
pub struct __gnu_cxx_new_allocator {
    pub _address: u8,
}
pub type __gnu_cxx_new_allocator_value_type<_Tp> = _Tp;
pub type __gnu_cxx_new_allocator_size_type = usize;
pub type __gnu_cxx_new_allocator_difference_type = isize;
pub type __gnu_cxx_new_allocator_pointer<_Tp> = *mut _Tp;
pub type __gnu_cxx_new_allocator_const_pointer<_Tp> = *const _Tp;
pub type __gnu_cxx_new_allocator_reference<_Tp> = *mut _Tp;
pub type __gnu_cxx_new_allocator_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx_new_allocator_rebind {
    pub _address: u8,
}
pub type __gnu_cxx_new_allocator_propagate_on_container_move_assignment = std_true_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___alloc_traits {
    pub _address: u8,
}
pub type __gnu_cxx___alloc_traits_allocator_type<_Alloc> = _Alloc;
pub type __gnu_cxx___alloc_traits__Base_type = u8;
pub type __gnu_cxx___alloc_traits_value_type = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_pointer = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_const_pointer = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_size_type = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_difference_type = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_reference = *mut __gnu_cxx___alloc_traits_value_type;
pub type __gnu_cxx___alloc_traits_const_reference = *const __gnu_cxx___alloc_traits_value_type;
pub type __gnu_cxx___alloc_traits___is_custom_pointer = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___alloc_traits_rebind {
    pub _address: u8,
}
pub type __gnu_cxx___alloc_traits_rebind_other = __gnu_cxx___alloc_traits__Base_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___aligned_membuf {
    pub _M_storage: *mut ::std::os::raw::c_uchar,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___aligned_membuf__Tp2<_Tp> {
    pub _M_t: _Tp,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___aligned_buffer {
    pub _M_storage: u8,
}
pub const __gnu_cxx__Lock_policy__S_single: __gnu_cxx__Lock_policy = 0;
pub const __gnu_cxx__Lock_policy__S_mutex: __gnu_cxx__Lock_policy = 1;
pub const __gnu_cxx__Lock_policy__S_atomic: __gnu_cxx__Lock_policy = 2;
pub type __gnu_cxx__Lock_policy = ::std::os::raw::c_uint;
extern "C" {
    #[link_name = "\u{1}_ZN9__gnu_cxxL21__default_lock_policyE"]
    pub static __gnu_cxx___default_lock_policy: __gnu_cxx__Lock_policy;
}
#[repr(C)]
#[derive(Debug)]
pub struct __gnu_cxx___concurrence_lock_error {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout___gnu_cxx___concurrence_lock_error() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___concurrence_lock_error>(),
        8usize,
        concat!("Size of: ", stringify!(__gnu_cxx___concurrence_lock_error))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___concurrence_lock_error>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__gnu_cxx___concurrence_lock_error)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct __gnu_cxx___concurrence_unlock_error {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout___gnu_cxx___concurrence_unlock_error() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___concurrence_unlock_error>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__gnu_cxx___concurrence_unlock_error)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___concurrence_unlock_error>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__gnu_cxx___concurrence_unlock_error)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct __gnu_cxx___concurrence_broadcast_error {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout___gnu_cxx___concurrence_broadcast_error() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___concurrence_broadcast_error>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__gnu_cxx___concurrence_broadcast_error)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___concurrence_broadcast_error>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__gnu_cxx___concurrence_broadcast_error)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct __gnu_cxx___concurrence_wait_error {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout___gnu_cxx___concurrence_wait_error() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___concurrence_wait_error>(),
        8usize,
        concat!("Size of: ", stringify!(__gnu_cxx___concurrence_wait_error))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___concurrence_wait_error>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__gnu_cxx___concurrence_wait_error)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct __gnu_cxx___mutex {
    pub _M_mutex: __gthread_mutex_t,
}
#[test]
fn bindgen_test_layout___gnu_cxx___mutex() {
    const UNINIT: ::std::mem::MaybeUninit<__gnu_cxx___mutex> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___mutex>(),
        8usize,
        concat!("Size of: ", stringify!(__gnu_cxx___mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(__gnu_cxx___mutex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._M_mutex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__gnu_cxx___mutex),
            "::",
            stringify!(_M_mutex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___recursive_mutex {
    pub _M_mutex: __gthread_recursive_mutex_t,
}
#[test]
fn bindgen_test_layout___gnu_cxx___recursive_mutex() {
    const UNINIT: ::std::mem::MaybeUninit<__gnu_cxx___recursive_mutex> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___recursive_mutex>(),
        8usize,
        concat!("Size of: ", stringify!(__gnu_cxx___recursive_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___recursive_mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(__gnu_cxx___recursive_mutex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._M_mutex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__gnu_cxx___recursive_mutex),
            "::",
            stringify!(_M_mutex)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct __gnu_cxx___scoped_lock {
    pub _M_device: *mut __gnu_cxx___scoped_lock___mutex_type,
}
pub type __gnu_cxx___scoped_lock___mutex_type = __gnu_cxx___mutex;
#[test]
fn bindgen_test_layout___gnu_cxx___scoped_lock() {
    const UNINIT: ::std::mem::MaybeUninit<__gnu_cxx___scoped_lock> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___scoped_lock>(),
        8usize,
        concat!("Size of: ", stringify!(__gnu_cxx___scoped_lock))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___scoped_lock>(),
        8usize,
        concat!("Alignment of ", stringify!(__gnu_cxx___scoped_lock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._M_device) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__gnu_cxx___scoped_lock),
            "::",
            stringify!(_M_device)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___cond {
    pub _M_cond: __gthread_cond_t,
}
#[test]
fn bindgen_test_layout___gnu_cxx___cond() {
    const UNINIT: ::std::mem::MaybeUninit<__gnu_cxx___cond> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___cond>(),
        8usize,
        concat!("Size of: ", stringify!(__gnu_cxx___cond))
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___cond>(),
        8usize,
        concat!("Alignment of ", stringify!(__gnu_cxx___cond))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._M_cond) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__gnu_cxx___cond),
            "::",
            stringify!(_M_cond)
        )
    );
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __gnuc_va_list;
extern "C" {
    pub fn __mingw_get_crt_info() -> *const ::std::os::raw::c_char;
}
pub type rsize_t = usize;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type errno_t = ::std::os::raw::c_int;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
pub type time_t = __time64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct threadmbcinfostruct {
    _unused: [u8; 0],
}
pub type pthreadlocinfo = *mut threadlocaleinfostruct;
pub type pthreadmbcinfo = *mut threadmbcinfostruct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lc_time_data {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct localeinfo_struct {
    pub locinfo: pthreadlocinfo,
    pub mbcinfo: pthreadmbcinfo,
}
#[test]
fn bindgen_test_layout_localeinfo_struct() {
    const UNINIT: ::std::mem::MaybeUninit<localeinfo_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<localeinfo_struct>(),
        16usize,
        concat!("Size of: ", stringify!(localeinfo_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<localeinfo_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(localeinfo_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(localeinfo_struct),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(localeinfo_struct),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_tstruct = localeinfo_struct;
pub type _locale_t = *mut localeinfo_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagLC_ID {
    pub wLanguage: ::std::os::raw::c_ushort,
    pub wCountry: ::std::os::raw::c_ushort,
    pub wCodePage: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_tagLC_ID() {
    const UNINIT: ::std::mem::MaybeUninit<tagLC_ID> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagLC_ID>(),
        6usize,
        concat!("Size of: ", stringify!(tagLC_ID))
    );
    assert_eq!(
        ::std::mem::align_of::<tagLC_ID>(),
        2usize,
        concat!("Alignment of ", stringify!(tagLC_ID))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wLanguage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagLC_ID),
            "::",
            stringify!(wLanguage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wCountry) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tagLC_ID),
            "::",
            stringify!(wCountry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wCodePage) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagLC_ID),
            "::",
            stringify!(wCodePage)
        )
    );
}
pub type LC_ID = tagLC_ID;
pub type LPLC_ID = *mut tagLC_ID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct threadlocaleinfostruct {
    pub refcount: ::std::os::raw::c_int,
    pub lc_codepage: ::std::os::raw::c_uint,
    pub lc_collate_cp: ::std::os::raw::c_uint,
    pub lc_handle: [::std::os::raw::c_ulong; 6usize],
    pub lc_id: [LC_ID; 6usize],
    pub lc_category: [threadlocaleinfostruct__bindgen_ty_1; 6usize],
    pub lc_clike: ::std::os::raw::c_int,
    pub mb_cur_max: ::std::os::raw::c_int,
    pub lconv_intl_refcount: *mut ::std::os::raw::c_int,
    pub lconv_num_refcount: *mut ::std::os::raw::c_int,
    pub lconv_mon_refcount: *mut ::std::os::raw::c_int,
    pub lconv: *mut lconv,
    pub ctype1_refcount: *mut ::std::os::raw::c_int,
    pub ctype1: *mut ::std::os::raw::c_ushort,
    pub pctype: *const ::std::os::raw::c_ushort,
    pub pclmap: *const ::std::os::raw::c_uchar,
    pub pcumap: *const ::std::os::raw::c_uchar,
    pub lc_time_curr: *mut __lc_time_data,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct threadlocaleinfostruct__bindgen_ty_1 {
    pub locale: *mut ::std::os::raw::c_char,
    pub wlocale: *mut u16,
    pub refcount: *mut ::std::os::raw::c_int,
    pub wrefcount: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_threadlocaleinfostruct__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<threadlocaleinfostruct__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<threadlocaleinfostruct__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(threadlocaleinfostruct__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<threadlocaleinfostruct__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(threadlocaleinfostruct__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locale) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct__bindgen_ty_1),
            "::",
            stringify!(locale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wlocale) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct__bindgen_ty_1),
            "::",
            stringify!(wlocale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct__bindgen_ty_1),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrefcount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct__bindgen_ty_1),
            "::",
            stringify!(wrefcount)
        )
    );
}
#[test]
fn bindgen_test_layout_threadlocaleinfostruct() {
    const UNINIT: ::std::mem::MaybeUninit<threadlocaleinfostruct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<threadlocaleinfostruct>(),
        352usize,
        concat!("Size of: ", stringify!(threadlocaleinfostruct))
    );
    assert_eq!(
        ::std::mem::align_of::<threadlocaleinfostruct>(),
        8usize,
        concat!("Alignment of ", stringify!(threadlocaleinfostruct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_codepage) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lc_codepage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_collate_cp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lc_collate_cp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_handle) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lc_handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_id) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lc_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_category) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lc_category)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_clike) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lc_clike)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mb_cur_max) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lconv_intl_refcount) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lconv_intl_refcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lconv_num_refcount) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lconv_num_refcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lconv_mon_refcount) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lconv_mon_refcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lconv) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lconv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctype1_refcount) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(ctype1_refcount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctype1) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(ctype1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pctype) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pclmap) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(pclmap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcumap) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(pcumap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lc_time_curr) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(threadlocaleinfostruct),
            "::",
            stringify!(lc_time_curr)
        )
    );
}
pub type threadlocinfo = threadlocaleinfostruct;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type int_least32_t = ::std::os::raw::c_int;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type int_fast16_t = ::std::os::raw::c_short;
pub type uint_fast16_t = ::std::os::raw::c_ushort;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_debug__Safe_iterator {
    pub _address: u8,
}
#[doc = " @class NAME\n\n @brief A class that represents an ISO11783 control function NAME from an address claim."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct isobus_NAME {
    #[doc = "< A raw, 64 bit NAME encoded with all NAMEParameters"]
    pub rawName: u64,
}
#[doc = "< Usually the serial number of the ECU, unique for all similar control functions"]
pub const isobus_NAME_NAMEParameters_IdentityNumber: isobus_NAME_NAMEParameters = 0;
#[doc = "< The J1939/ISO11783 manufacturer code of the ECU with this NAME"]
pub const isobus_NAME_NAMEParameters_ManufacturerCode: isobus_NAME_NAMEParameters = 1;
#[doc = "< The ECU instance of the ECU with this NAME. Usually increments in NAME order with similar CFs"]
pub const isobus_NAME_NAMEParameters_EcuInstance: isobus_NAME_NAMEParameters = 2;
#[doc = "< The function instance of the ECU. Similar to Virtual Terminal number."]
pub const isobus_NAME_NAMEParameters_FunctionInstance: isobus_NAME_NAMEParameters = 3;
#[doc = "< The function of the ECU, as defined by ISO11783"]
pub const isobus_NAME_NAMEParameters_FunctionCode: isobus_NAME_NAMEParameters = 4;
#[doc = "< Also known as the vehicle system from J1939, describes general ECU type"]
pub const isobus_NAME_NAMEParameters_DeviceClass: isobus_NAME_NAMEParameters = 5;
#[doc = "< The instance number of this device class"]
pub const isobus_NAME_NAMEParameters_DeviceClassInstance: isobus_NAME_NAMEParameters = 6;
#[doc = "< The industry group associated with this ECU, such as \"agricultural\""]
pub const isobus_NAME_NAMEParameters_IndustryGroup: isobus_NAME_NAMEParameters = 7;
#[doc = "< Defines if this ECU supports address arbitration"]
pub const isobus_NAME_NAMEParameters_ArbitraryAddressCapable: isobus_NAME_NAMEParameters = 8;
#[doc = " @brief The encoded components that comprise a NAME"]
pub type isobus_NAME_NAMEParameters = ::std::os::raw::c_int;
#[doc = "< The typical mechanical power source of the machine"]
pub const isobus_NAME_Function_Engine: isobus_NAME_Function = 0;
#[doc = "< Power source for operating systems without the use of the prime drive engine"]
pub const isobus_NAME_Function_AuxiliaryPowerUnit: isobus_NAME_Function = 1;
#[doc = "< Control system which operates the drive mechanism when it is electrically powered"]
pub const isobus_NAME_Function_ElectricPropulsionControl: isobus_NAME_Function = 2;
#[doc = "< Mechanical system for altering the speed vs. torque output of the engine"]
pub const isobus_NAME_Function_Transmission: isobus_NAME_Function = 3;
#[doc = "< Monitors the condition of a battery pack"]
pub const isobus_NAME_Function_BatteryPackMonitor: isobus_NAME_Function = 4;
#[doc = "< Control Unit that determines and transmits onto the network the gear desired by the operator"]
pub const isobus_NAME_Function_ShiftControl: isobus_NAME_Function = 5;
#[doc = "< System that controls the mechanical power derived from a prime engine and used to operate auxiliary items"]
pub const isobus_NAME_Function_PowerTakeOffRearOrPrimary: isobus_NAME_Function = 6;
#[doc = "< Adjusts attack angle of steering axle"]
pub const isobus_NAME_Function_SteeringAxle: isobus_NAME_Function = 7;
#[doc = "< Adjusts attack angle of driving axle"]
pub const isobus_NAME_Function_DrivingAxle: isobus_NAME_Function = 8;
#[doc = "< Controls service braking system electronically"]
pub const isobus_NAME_Function_SystemControlBrakes: isobus_NAME_Function = 9;
#[doc = "< Control for actuating the service brakes on a steered axle"]
pub const isobus_NAME_Function_SteerAxleControlBrakes: isobus_NAME_Function = 10;
#[doc = "< Control for actuating the service brakes on a drive axle"]
pub const isobus_NAME_Function_DriveAxleControlBrakes: isobus_NAME_Function = 11;
#[doc = "< Controller for the retarder capabilities of the engine"]
pub const isobus_NAME_Function_EnginerRetarder: isobus_NAME_Function = 12;
#[doc = "< Controller for the retarder capabilities of the driveline"]
pub const isobus_NAME_Function_DrivelineRetarder: isobus_NAME_Function = 13;
#[doc = "< Control system for maintaining the vehicle's speed at a fixed operator selectable value"]
pub const isobus_NAME_Function_CruiseControl: isobus_NAME_Function = 14;
#[doc = "< Controls fuel flow from the tank to the filter to the water removal/separator to the engine and then back to the tank"]
pub const isobus_NAME_Function_FuelSystem: isobus_NAME_Function = 15;
#[doc = "< Controls steering in steer-by-wire"]
pub const isobus_NAME_Function_SteeringControl: isobus_NAME_Function = 16;
#[doc = "< Control system for the suspension of a steered axle"]
pub const isobus_NAME_Function_SteerAxleSuspensionControl: isobus_NAME_Function = 17;
#[doc = "< Control system for the suspension of a driven axle"]
pub const isobus_NAME_Function_DriveAxleSuspensionControl: isobus_NAME_Function = 18;
#[doc = "< Gauge display for a vehicle, usually in the cab"]
pub const isobus_NAME_Function_InstrumentCluster: isobus_NAME_Function = 19;
#[doc = "< System for accumulating data versus travel of the vehicle"]
pub const isobus_NAME_Function_TripRecorder: isobus_NAME_Function = 20;
#[doc = "< System for controlling the climate within the cab of the vehicle"]
pub const isobus_NAME_Function_CabClimateControl: isobus_NAME_Function = 21;
#[doc = "< Modifies drag by altering body panels"]
pub const isobus_NAME_Function_AerodynamicControl: isobus_NAME_Function = 22;
#[doc = "< System associated with the vehicles physical location"]
pub const isobus_NAME_Function_VehicleNavigation: isobus_NAME_Function = 23;
#[doc = "< System for comparing operator-provided data sequences against reference"]
pub const isobus_NAME_Function_VehicleSecurity: isobus_NAME_Function = 24;
#[doc = "< ECU for connecting different network segments together"]
pub const isobus_NAME_Function_NetworkInterconnectUnit: isobus_NAME_Function = 25;
#[doc = "< Can handle suspension control for the body sections independent from the axle sections"]
pub const isobus_NAME_Function_BodyControl: isobus_NAME_Function = 26;
#[doc = "< System that controls the mechanical power derived from a prime engine and used to operate auxiliary items"]
pub const isobus_NAME_Function_PowerTakeOffFrontOrSecondary: isobus_NAME_Function = 27;
#[doc = "< ECU for connecting between vehicle network(s) and an off-vehicle system or network"]
pub const isobus_NAME_Function_OffVehicleGateway: isobus_NAME_Function = 28;
#[doc = "< General-purpose intelligent display with a specific message set defined in ISO 11783-6"]
pub const isobus_NAME_Function_VirtualTerminal: isobus_NAME_Function = 29;
#[doc = "< Manages vehicle systems, i.e. powertrain"]
pub const isobus_NAME_Function_ManagementComputerOne: isobus_NAME_Function = 30;
#[doc = "< Unit used to charge propulsion batteries in an electric vehicle"]
pub const isobus_NAME_Function_PropulsionBatteryCharger: isobus_NAME_Function = 31;
#[doc = "< Forward-looking collision avoidance, collision warning, speed controller, or speed control"]
pub const isobus_NAME_Function_HeadwayControl: isobus_NAME_Function = 32;
#[doc = "< Generic system monitor"]
pub const isobus_NAME_Function_SystemMonitor: isobus_NAME_Function = 33;
#[doc = "< Pump controller that provides hydraulic power"]
pub const isobus_NAME_Function_HydraulicPumpControl: isobus_NAME_Function = 34;
#[doc = "< Controller responsible for coordinating the over-all suspension of a vehicle"]
pub const isobus_NAME_Function_SystemControlSuspension: isobus_NAME_Function = 35;
#[doc = "< Controller responsible for coordinating the pneumatics of a vehicle"]
pub const isobus_NAME_Function_SystemControlPneumatic: isobus_NAME_Function = 36;
#[doc = "< Controller located in/near vehicle cab used to perform functions that are grouped together for convenience"]
pub const isobus_NAME_Function_CabController: isobus_NAME_Function = 37;
#[doc = "< Unit that provides control of centralized tire inflation"]
pub const isobus_NAME_Function_TirePressureControl: isobus_NAME_Function = 38;
#[doc = "< Unit for altering the ignition of an engine"]
pub const isobus_NAME_Function_IgnitionControl: isobus_NAME_Function = 39;
#[doc = "< System for controlling the seats (operator and passenger) within the cab"]
pub const isobus_NAME_Function_SeatControl: isobus_NAME_Function = 40;
#[doc = "< Controller for sending the operator lighting controls messages"]
pub const isobus_NAME_Function_OperatorControlsLighting: isobus_NAME_Function = 41;
#[doc = "< Controller for a water pump mounted on the vehicle/machine"]
pub const isobus_NAME_Function_WaterPumpControl: isobus_NAME_Function = 42;
#[doc = "< Display designed specifically to display transmission information"]
pub const isobus_NAME_Function_TransmissionDisplay: isobus_NAME_Function = 43;
#[doc = "< Emissions controller"]
pub const isobus_NAME_Function_ExhaustEmissionControl: isobus_NAME_Function = 44;
#[doc = "< Stability controller"]
pub const isobus_NAME_Function_VehicleDynamicStabilityControl: isobus_NAME_Function = 45;
#[doc = "< Monitors oil level, life, temperature"]
pub const isobus_NAME_Function_OilSystemMonitor: isobus_NAME_Function = 46;
#[doc = "< Information management for a vehicle's application, such as cargo management"]
pub const isobus_NAME_Function_InformationSystemControl: isobus_NAME_Function = 47;
#[doc = "< Loading unloading chairlift, ramps, lifts or tailgates"]
pub const isobus_NAME_Function_RampControl: isobus_NAME_Function = 48;
#[doc = "< When transmission is distributed this handles torque converter lock-up or engine-transmission connection"]
pub const isobus_NAME_Function_ClutchConverterControl: isobus_NAME_Function = 49;
#[doc = "< Primary heat typically being taken from the engine coolant"]
pub const isobus_NAME_Function_AuxiliaryHeater: isobus_NAME_Function = 50;
#[doc = "< System which detects and warns of impending collision"]
pub const isobus_NAME_Function_ForwardLookingCollisionWarningSystem: isobus_NAME_Function = 51;
#[doc = "< Controls the chassis (not body or cab) components"]
pub const isobus_NAME_Function_ChassisControl: isobus_NAME_Function = 52;
#[doc = "< Vehicle's primary on-board charging controller"]
pub const isobus_NAME_Function_AlternatorElectricalChargingSystem: isobus_NAME_Function = 53;
#[doc = "< Radio communications unit designed to communicate via the cellular telephone system"]
pub const isobus_NAME_Function_CommunicationsCellular: isobus_NAME_Function = 54;
#[doc = "< Radio communications unit designed specifically to communicate via some satellite system"]
pub const isobus_NAME_Function_CommunicationsSatellite: isobus_NAME_Function = 55;
#[doc = "< Radio unit designed specifically to communicate via a terrestrial p2p system"]
pub const isobus_NAME_Function_CommunicationsRadio: isobus_NAME_Function = 56;
#[doc = "< Unit that gathers the operator inputs from switches/levers/etc and transmits associated messages"]
pub const isobus_NAME_Function_OperatorControlsSteeringColumn: isobus_NAME_Function = 57;
#[doc = "< Primary control system affecting the operation of the main cooling fan"]
pub const isobus_NAME_Function_FanDriveControl: isobus_NAME_Function = 58;
#[doc = "< Mechanical system for initiating rotation in an engine"]
pub const isobus_NAME_Function_Starter: isobus_NAME_Function = 59;
#[doc = "< Used for a fairly elaborate in cab display, non VT and non instrument cluster"]
pub const isobus_NAME_Function_CabDisplayCab: isobus_NAME_Function = 60;
#[doc = "< Printing or file storage unit on the network"]
pub const isobus_NAME_Function_FileServerOrPrinter: isobus_NAME_Function = 61;
#[doc = "< Tool that can be permanently mounted on the vehicle and which may not support all of the ISO 11783-12 messages"]
pub const isobus_NAME_Function_OnboardDiagnosticUnit: isobus_NAME_Function = 62;
#[doc = "< Control system used to manipulate the actuation of engine intake or exhaust"]
pub const isobus_NAME_Function_EngineValveController: isobus_NAME_Function = 63;
#[doc = "< Sum of all units in a vehicle which enable the driver to brake with virtually no friction"]
pub const isobus_NAME_Function_EnduranceBraking: isobus_NAME_Function = 64;
#[doc = "< Provides measurement of gas flow rates and associated parameters"]
pub const isobus_NAME_Function_GasFlowMeasurement: isobus_NAME_Function = 65;
#[doc = "< Reporting and/or control unit for external input and output channels"]
pub const isobus_NAME_Function_IOController: isobus_NAME_Function = 66;
#[doc = "< Can include load centres, fuse boxes and power distribution boards"]
pub const isobus_NAME_Function_ElectricalSystemController: isobus_NAME_Function = 67;
#[doc = "< Reserved range beginning"]
pub const isobus_NAME_Function_Reserved: isobus_NAME_Function = 68;
#[doc = "< Max allocated function code"]
pub const isobus_NAME_Function_MaxFunctionCode: isobus_NAME_Function = 127;
#[doc = " @brief See ISO11783-1 For complete descriptions of the ISO NAME function codes"]
pub type isobus_NAME_Function = ::std::os::raw::c_int;
#[doc = " @brief A structure that tracks the pair of a NAME parameter and associated value"]
pub type isobus_NAME_NameParameterFilter = u8;
#[test]
fn bindgen_test_layout_isobus_NAME() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_NAME> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_NAME>(),
        8usize,
        concat!("Size of: ", stringify!(isobus_NAME))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_NAME>(),
        8usize,
        concat!("Alignment of ", stringify!(isobus_NAME))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rawName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_NAME),
            "::",
            stringify!(rawName)
        )
    );
}
extern "C" {
    #[doc = " @brief Returns if the ECU is capable of address arbitration\n @returns true if the ECU can arbitrate addresses"]
    #[link_name = "\u{1}_ZNK6isobus4NAME29get_arbitrary_address_capableEv"]
    pub fn isobus_NAME_get_arbitrary_address_capable(this: *const isobus_NAME) -> bool;
}
extern "C" {
    #[doc = " @brief Sets the data in the NAME that corresponds to the arbitration capability of the ECU\n @param[in] value True if the ECU supports arbitration, false if not"]
    #[link_name = "\u{1}_ZN6isobus4NAME29set_arbitrary_address_capableEb"]
    pub fn isobus_NAME_set_arbitrary_address_capable(this: *mut isobus_NAME, value: bool);
}
extern "C" {
    #[doc = " @brief Returns the industry group encoded in the NAME\n @returns The industry group encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME18get_industry_groupEv"]
    pub fn isobus_NAME_get_industry_group(this: *const isobus_NAME) -> u8;
}
extern "C" {
    #[doc = " @brief Sets the industry group encoded in the NAME\n @param[in] value The industry group to encode in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME18set_industry_groupEh"]
    pub fn isobus_NAME_set_industry_group(this: *mut isobus_NAME, value: u8);
}
extern "C" {
    #[doc = " @brief Returns the device class (vehicle system) encoded in the NAME\n @returns The device class (vehicle system) encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME25get_device_class_instanceEv"]
    pub fn isobus_NAME_get_device_class_instance(this: *const isobus_NAME) -> u8;
}
extern "C" {
    #[doc = " @brief Sets the device class instance (vehicle system) to be encoded in the NAME\n @param[in] value The device class instance (vehicle system) to be encoded in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME25set_device_class_instanceEh"]
    pub fn isobus_NAME_set_device_class_instance(this: *mut isobus_NAME, value: u8);
}
extern "C" {
    #[doc = " @brief Returns the device class (vehicle system) encoded in the NAME\n @returns The device class (vehicle system) encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME16get_device_classEv"]
    pub fn isobus_NAME_get_device_class(this: *const isobus_NAME) -> u8;
}
extern "C" {
    #[doc = " @brief Sets the device class (vehicle system) to be encoded in the NAME\n @param[in] value The device class (vehicle system) to be encoded in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME16set_device_classEh"]
    pub fn isobus_NAME_set_device_class(this: *mut isobus_NAME, value: u8);
}
extern "C" {
    #[doc = " @brief Gets the function code encoded in the NAME\n @returns The function code encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME17get_function_codeEv"]
    pub fn isobus_NAME_get_function_code(this: *const isobus_NAME) -> u8;
}
extern "C" {
    #[doc = " @brief Sets the function code encoded in the NAME\n @param[in] value The function code to be encoded in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME17set_function_codeEh"]
    pub fn isobus_NAME_set_function_code(this: *mut isobus_NAME, value: u8);
}
extern "C" {
    #[doc = " @brief Gets the function instance encoded in the NAME\n @returns The function instance encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME21get_function_instanceEv"]
    pub fn isobus_NAME_get_function_instance(this: *const isobus_NAME) -> u8;
}
extern "C" {
    #[doc = " @brief Sets the function instance encoded in the NAME\n @param[in] value The function instance to be encoded in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME21set_function_instanceEh"]
    pub fn isobus_NAME_set_function_instance(this: *mut isobus_NAME, value: u8);
}
extern "C" {
    #[doc = " @brief Gets the ecu instance encoded in the NAME\n @returns The ecu instance encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME16get_ecu_instanceEv"]
    pub fn isobus_NAME_get_ecu_instance(this: *const isobus_NAME) -> u8;
}
extern "C" {
    #[doc = " @brief Sets the ecu instance encoded in the NAME\n @param[in] value The ecu instance to be encoded in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME16set_ecu_instanceEh"]
    pub fn isobus_NAME_set_ecu_instance(this: *mut isobus_NAME, value: u8);
}
extern "C" {
    #[doc = " @brief Gets the manufacturer code encoded in the NAME\n @returns The manufacturer code encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME21get_manufacturer_codeEv"]
    pub fn isobus_NAME_get_manufacturer_code(this: *const isobus_NAME) -> u16;
}
extern "C" {
    #[doc = " @brief Sets the manufacturer code encoded in the NAME\n @param[in] value The manufacturer code to be encoded in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME21set_manufacturer_codeEt"]
    pub fn isobus_NAME_set_manufacturer_code(this: *mut isobus_NAME, value: u16);
}
extern "C" {
    #[doc = " @brief Gets the identity number encoded in the NAME\n @returns The identity number encoded in the NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME19get_identity_numberEv"]
    pub fn isobus_NAME_get_identity_number(this: *const isobus_NAME) -> u32;
}
extern "C" {
    #[doc = " @brief Sets the identity number encoded in the NAME\n @param[in] value The identity number to be encoded in the NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME19set_identity_numberEj"]
    pub fn isobus_NAME_set_identity_number(this: *mut isobus_NAME, value: u32);
}
extern "C" {
    #[doc = " @brief Gets the raw 64 bit NAME\n @returns The raw 64 bit NAME"]
    #[link_name = "\u{1}_ZNK6isobus4NAME13get_full_nameEv"]
    pub fn isobus_NAME_get_full_name(this: *const isobus_NAME) -> u64;
}
extern "C" {
    #[doc = " @brief Sets the raw, encoded 64 bit NAME\n @param[in] value The raw, encoded 64 bit NAME"]
    #[link_name = "\u{1}_ZN6isobus4NAME13set_full_nameEy"]
    pub fn isobus_NAME_set_full_name(this: *mut isobus_NAME, value: u64);
}
extern "C" {
    #[doc = " @brief Constructor for a NAME\n @param[in] rawNAMEData The raw 64 bit NAME of an ECU"]
    #[link_name = "\u{1}_ZN6isobus4NAMEC1Ey"]
    pub fn isobus_NAME_NAME(this: *mut isobus_NAME, rawNAMEData: u64);
}
impl isobus_NAME {
    #[inline]
    pub unsafe fn get_arbitrary_address_capable(&self) -> bool {
        isobus_NAME_get_arbitrary_address_capable(self)
    }
    #[inline]
    pub unsafe fn set_arbitrary_address_capable(&mut self, value: bool) {
        isobus_NAME_set_arbitrary_address_capable(self, value)
    }
    #[inline]
    pub unsafe fn get_industry_group(&self) -> u8 {
        isobus_NAME_get_industry_group(self)
    }
    #[inline]
    pub unsafe fn set_industry_group(&mut self, value: u8) {
        isobus_NAME_set_industry_group(self, value)
    }
    #[inline]
    pub unsafe fn get_device_class_instance(&self) -> u8 {
        isobus_NAME_get_device_class_instance(self)
    }
    #[inline]
    pub unsafe fn set_device_class_instance(&mut self, value: u8) {
        isobus_NAME_set_device_class_instance(self, value)
    }
    #[inline]
    pub unsafe fn get_device_class(&self) -> u8 {
        isobus_NAME_get_device_class(self)
    }
    #[inline]
    pub unsafe fn set_device_class(&mut self, value: u8) {
        isobus_NAME_set_device_class(self, value)
    }
    #[inline]
    pub unsafe fn get_function_code(&self) -> u8 {
        isobus_NAME_get_function_code(self)
    }
    #[inline]
    pub unsafe fn set_function_code(&mut self, value: u8) {
        isobus_NAME_set_function_code(self, value)
    }
    #[inline]
    pub unsafe fn get_function_instance(&self) -> u8 {
        isobus_NAME_get_function_instance(self)
    }
    #[inline]
    pub unsafe fn set_function_instance(&mut self, value: u8) {
        isobus_NAME_set_function_instance(self, value)
    }
    #[inline]
    pub unsafe fn get_ecu_instance(&self) -> u8 {
        isobus_NAME_get_ecu_instance(self)
    }
    #[inline]
    pub unsafe fn set_ecu_instance(&mut self, value: u8) {
        isobus_NAME_set_ecu_instance(self, value)
    }
    #[inline]
    pub unsafe fn get_manufacturer_code(&self) -> u16 {
        isobus_NAME_get_manufacturer_code(self)
    }
    #[inline]
    pub unsafe fn set_manufacturer_code(&mut self, value: u16) {
        isobus_NAME_set_manufacturer_code(self, value)
    }
    #[inline]
    pub unsafe fn get_identity_number(&self) -> u32 {
        isobus_NAME_get_identity_number(self)
    }
    #[inline]
    pub unsafe fn set_identity_number(&mut self, value: u32) {
        isobus_NAME_set_identity_number(self, value)
    }
    #[inline]
    pub unsafe fn get_full_name(&self) -> u64 {
        isobus_NAME_get_full_name(self)
    }
    #[inline]
    pub unsafe fn set_full_name(&mut self, value: u64) {
        isobus_NAME_set_full_name(self, value)
    }
    #[inline]
    pub unsafe fn new(rawNAMEData: u64) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_NAME_NAME(__bindgen_tmp.as_mut_ptr(), rawNAMEData);
        __bindgen_tmp.assume_init()
    }
}
#[doc = " @class AddressClaimStateMachine\n\n @brief State machine for managing the J1939/ISO11783 address claim process\n\n @details This class manages address claiming for internal control functions\n and keeps track of things like requests for address claim."]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_AddressClaimStateMachine {
    #[doc = "< The ISO NAME to claim as"]
    pub m_isoname: isobus_NAME,
    #[doc = "< The address claim state machine state"]
    pub m_currentState: isobus_AddressClaimStateMachine_State,
    #[doc = "< A generic timestamp in milliseconds used to find timeouts"]
    pub m_timestamp_ms: u32,
    #[doc = "< The CAN channel index to claim on"]
    pub m_portIndex: u8,
    #[doc = "< The address we'd prefer to claim as (we may not get it)"]
    pub m_preferredAddress: u8,
    #[doc = "< The random delay as required by the ISO11783 standard"]
    pub m_randomClaimDelay_ms: u8,
    #[doc = "< The actual address we ended up claiming"]
    pub m_claimedAddress: u8,
    #[doc = "<  Enable/disable state for this state machine"]
    pub m_enabled: bool,
}
#[doc = "< Address claiming is uninitialized"]
pub const isobus_AddressClaimStateMachine_State_None: isobus_AddressClaimStateMachine_State = 0;
#[doc = "< State machine is waiting for the random delay time"]
pub const isobus_AddressClaimStateMachine_State_WaitForClaim:
    isobus_AddressClaimStateMachine_State = 1;
#[doc = "< State machine is sending the request for address claim"]
pub const isobus_AddressClaimStateMachine_State_SendRequestForClaim:
    isobus_AddressClaimStateMachine_State = 2;
#[doc = "< State machine is waiting for the address claim contention period"]
pub const isobus_AddressClaimStateMachine_State_WaitForRequestContentionPeriod:
    isobus_AddressClaimStateMachine_State = 3;
#[doc = "< State machine is claiming the prefferred address"]
pub const isobus_AddressClaimStateMachine_State_SendPreferredAddressClaim:
    isobus_AddressClaimStateMachine_State = 4;
#[doc = "< State machine is contending the prefferred address"]
pub const isobus_AddressClaimStateMachine_State_ContendForPreferredAddress:
    isobus_AddressClaimStateMachine_State = 5;
#[doc = "< State machine is claiming an address"]
pub const isobus_AddressClaimStateMachine_State_SendArbitraryAddressClaim:
    isobus_AddressClaimStateMachine_State = 6;
#[doc = "< An ECU requested address claim, inform the bus of our current address"]
pub const isobus_AddressClaimStateMachine_State_SendReclaimAddressOnRequest:
    isobus_AddressClaimStateMachine_State = 7;
#[doc = "< State machine could not claim an address"]
pub const isobus_AddressClaimStateMachine_State_UnableToClaim:
    isobus_AddressClaimStateMachine_State = 8;
#[doc = "< Address claiming is complete and we have an address"]
pub const isobus_AddressClaimStateMachine_State_AddressClaimingComplete:
    isobus_AddressClaimStateMachine_State = 9;
#[doc = " @brief Defines the state machine states for address claiming"]
pub type isobus_AddressClaimStateMachine_State = ::std::os::raw::c_int;
#[test]
fn bindgen_test_layout_isobus_AddressClaimStateMachine() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_AddressClaimStateMachine> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_AddressClaimStateMachine>(),
        24usize,
        concat!("Size of: ", stringify!(isobus_AddressClaimStateMachine))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_AddressClaimStateMachine>(),
        8usize,
        concat!("Alignment of ", stringify!(isobus_AddressClaimStateMachine))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_isoname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_isoname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_currentState) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_currentState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_timestamp_ms) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_timestamp_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_portIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_portIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_preferredAddress) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_preferredAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_randomClaimDelay_ms) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_randomClaimDelay_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_claimedAddress) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_claimedAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_enabled) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_AddressClaimStateMachine),
            "::",
            stringify!(m_enabled)
        )
    );
}
extern "C" {
    #[doc = " @brief Returns the current state of the state machine\n @returns The current state of the state machine"]
    #[link_name = "\u{1}_ZNK6isobus24AddressClaimStateMachine17get_current_stateEv"]
    pub fn isobus_AddressClaimStateMachine_get_current_state(
        this: *const isobus_AddressClaimStateMachine,
    ) -> isobus_AddressClaimStateMachine_State;
}
extern "C" {
    #[doc = " @brief Enables or disables the address claimer\n @param[in] value true if you want the class to claim, false if you want to be a sniffer only"]
    #[link_name = "\u{1}_ZN6isobus24AddressClaimStateMachine14set_is_enabledEb"]
    pub fn isobus_AddressClaimStateMachine_set_is_enabled(
        this: *mut isobus_AddressClaimStateMachine,
        value: bool,
    );
}
extern "C" {
    #[doc = " @brief Returns if the address claimer is enabled\n @returns true if the class will address claim, false if in sniffing mode"]
    #[link_name = "\u{1}_ZNK6isobus24AddressClaimStateMachine11get_enabledEv"]
    pub fn isobus_AddressClaimStateMachine_get_enabled(
        this: *const isobus_AddressClaimStateMachine,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Returns the address claimed by the state machine or 0xFE if none claimed\n @returns The address claimed by the state machine or 0xFE if no address has been claimed"]
    #[link_name = "\u{1}_ZNK6isobus24AddressClaimStateMachine19get_claimed_addressEv"]
    pub fn isobus_AddressClaimStateMachine_get_claimed_address(
        this: *const isobus_AddressClaimStateMachine,
    ) -> u8;
}
extern "C" {
    #[doc = " @brief Updates the state machine, should be called periodically"]
    #[link_name = "\u{1}_ZN6isobus24AddressClaimStateMachine6updateEv"]
    pub fn isobus_AddressClaimStateMachine_update(this: *mut isobus_AddressClaimStateMachine);
}
extern "C" {
    #[doc = " @brief The constructor of the state machine class\n @param[in] preferredAddressValue The address you prefer to claim\n @param[in] ControlFunctionNAME The NAME you want to claim\n @param[in] portIndex The CAN channel index to claim on"]
    #[link_name = "\u{1}_ZN6isobus24AddressClaimStateMachineC1EhNS_4NAMEEh"]
    pub fn isobus_AddressClaimStateMachine_AddressClaimStateMachine(
        this: *mut isobus_AddressClaimStateMachine,
        preferredAddressValue: u8,
        ControlFunctionNAME: isobus_NAME,
        portIndex: u8,
    );
}
extern "C" {
    #[doc = " @brief The destructor for the address claim state machine"]
    #[link_name = "\u{1}_ZN6isobus24AddressClaimStateMachineD1Ev"]
    pub fn isobus_AddressClaimStateMachine_AddressClaimStateMachine_destructor(
        this: *mut isobus_AddressClaimStateMachine,
    );
}
impl isobus_AddressClaimStateMachine {
    #[inline]
    pub unsafe fn get_current_state(&self) -> isobus_AddressClaimStateMachine_State {
        isobus_AddressClaimStateMachine_get_current_state(self)
    }
    #[inline]
    pub unsafe fn set_is_enabled(&mut self, value: bool) {
        isobus_AddressClaimStateMachine_set_is_enabled(self, value)
    }
    #[inline]
    pub unsafe fn get_enabled(&self) -> bool {
        isobus_AddressClaimStateMachine_get_enabled(self)
    }
    #[inline]
    pub unsafe fn get_claimed_address(&self) -> u8 {
        isobus_AddressClaimStateMachine_get_claimed_address(self)
    }
    #[inline]
    pub unsafe fn update(&mut self) {
        isobus_AddressClaimStateMachine_update(self)
    }
    #[inline]
    pub unsafe fn new(
        preferredAddressValue: u8,
        ControlFunctionNAME: isobus_NAME,
        portIndex: u8,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_AddressClaimStateMachine_AddressClaimStateMachine(
            __bindgen_tmp.as_mut_ptr(),
            preferredAddressValue,
            ControlFunctionNAME,
            portIndex,
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        isobus_AddressClaimStateMachine_AddressClaimStateMachine_destructor(self)
    }
}
#[doc = "! @cond DoNotRaiseWarning"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct isobus_CANLibBadge {
    pub _address: u8,
}
#[repr(C)]
pub struct isobus_ControlFunction__bindgen_vtable(::std::os::raw::c_void);
#[doc = " @class ControlFunction\n\n @brief A class that describes an ISO11783 control function, which includes a NAME and address."]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_ControlFunction {
    pub vtable_: *const isobus_ControlFunction__bindgen_vtable,
    #[doc = "< The NAME of the control function"]
    pub controlFunctionNAME: isobus_NAME,
    #[doc = "< The Type of the control function"]
    pub controlFunctionType: isobus_ControlFunction_Type,
    #[doc = "< The address of the control function"]
    pub address: u8,
    #[doc = "< The CAN channel index of the control function"]
    pub canPortIndex: u8,
}
#[doc = "< The control function is part of our stack and can address claim"]
pub const isobus_ControlFunction_Type_Internal: isobus_ControlFunction_Type = 0;
#[doc = "< The control function is some other device on the bus"]
pub const isobus_ControlFunction_Type_External: isobus_ControlFunction_Type = 1;
#[doc = "< An external control function that you explicitly want to talk to"]
pub const isobus_ControlFunction_Type_Partnered: isobus_ControlFunction_Type = 2;
#[doc = " @brief The type of the control function"]
pub type isobus_ControlFunction_Type = ::std::os::raw::c_int;
extern "C" {
    #[doc = "< Protects the control function tables"]
    #[link_name = "\u{1}_ZN6isobus15ControlFunction30controlFunctionProcessingMutexE"]
    pub static mut isobus_ControlFunction_controlFunctionProcessingMutex: std_mutex;
}
#[test]
fn bindgen_test_layout_isobus_ControlFunction() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_ControlFunction> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_ControlFunction>(),
        24usize,
        concat!("Size of: ", stringify!(isobus_ControlFunction))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_ControlFunction>(),
        8usize,
        concat!("Alignment of ", stringify!(isobus_ControlFunction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).controlFunctionNAME) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ControlFunction),
            "::",
            stringify!(controlFunctionNAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).controlFunctionType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ControlFunction),
            "::",
            stringify!(controlFunctionType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ControlFunction),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).canPortIndex) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ControlFunction),
            "::",
            stringify!(canPortIndex)
        )
    );
}
extern "C" {
    #[doc = " @brief Returns the current address of the control function\n @returns The current address of the control function"]
    #[link_name = "\u{1}_ZNK6isobus15ControlFunction11get_addressEv"]
    pub fn isobus_ControlFunction_get_address(this: *const isobus_ControlFunction) -> u8;
}
extern "C" {
    #[doc = " @brief Describes if the control function has a valid address (not NULL or global)\n @returns true if the address is < 0xFE"]
    #[link_name = "\u{1}_ZNK6isobus15ControlFunction17get_address_validEv"]
    pub fn isobus_ControlFunction_get_address_valid(this: *const isobus_ControlFunction) -> bool;
}
extern "C" {
    #[doc = " @brief Returns the CAN channel index the control function communicates on\n @returns The control function's CAN channel index"]
    #[link_name = "\u{1}_ZNK6isobus15ControlFunction12get_can_portEv"]
    pub fn isobus_ControlFunction_get_can_port(this: *const isobus_ControlFunction) -> u8;
}
extern "C" {
    #[doc = " @brief Returns the NAME of the control function as described by its address claim message\n @returns The control function's NAME"]
    #[link_name = "\u{1}_ZNK6isobus15ControlFunction8get_NAMEEv"]
    pub fn isobus_ControlFunction_get_NAME(this: *const isobus_ControlFunction) -> isobus_NAME;
}
extern "C" {
    #[doc = " @brief Returns the `Type` of the control function\n @returns The control function type"]
    #[link_name = "\u{1}_ZNK6isobus15ControlFunction8get_typeEv"]
    pub fn isobus_ControlFunction_get_type(
        this: *const isobus_ControlFunction,
    ) -> isobus_ControlFunction_Type;
}
extern "C" {
    #[doc = " @brief The base class constructor for a control function\n @param[in] NAMEValue The NAME of the control function\n @param[in] addressValue The current address of the control function\n @param[in] CANPort The CAN channel index that the control function communicates on"]
    #[link_name = "\u{1}_ZN6isobus15ControlFunctionC1ENS_4NAMEEhh"]
    pub fn isobus_ControlFunction_ControlFunction(
        this: *mut isobus_ControlFunction,
        NAMEValue: isobus_NAME,
        addressValue: u8,
        CANPort: u8,
    );
}
impl isobus_ControlFunction {
    #[inline]
    pub unsafe fn get_address(&self) -> u8 {
        isobus_ControlFunction_get_address(self)
    }
    #[inline]
    pub unsafe fn get_address_valid(&self) -> bool {
        isobus_ControlFunction_get_address_valid(self)
    }
    #[inline]
    pub unsafe fn get_can_port(&self) -> u8 {
        isobus_ControlFunction_get_can_port(self)
    }
    #[inline]
    pub unsafe fn get_NAME(&self) -> isobus_NAME {
        isobus_ControlFunction_get_NAME(self)
    }
    #[inline]
    pub unsafe fn get_type(&self) -> isobus_ControlFunction_Type {
        isobus_ControlFunction_get_type(self)
    }
    #[inline]
    pub unsafe fn new(NAMEValue: isobus_NAME, addressValue: u8, CANPort: u8) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_ControlFunction_ControlFunction(
            __bindgen_tmp.as_mut_ptr(),
            NAMEValue,
            addressValue,
            CANPort,
        );
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[doc = " @brief The base class destructor for a control function"]
    #[link_name = "\u{1}_ZN6isobus15ControlFunctionD1Ev"]
    pub fn isobus_ControlFunction_ControlFunction_destructor(this: *mut isobus_ControlFunction);
}
#[doc = " @class CANIdentifier\n\n @brief A utility class that allows easy interpretation of a 32 bit CAN identifier"]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_CANIdentifier {
    #[doc = "< The raw encoded 29 bit ID"]
    pub m_RawIdentifier: u32,
}
#[doc = "< Highest CAN priority"]
pub const isobus_CANIdentifier_CANPriority_PriorityHighest0: isobus_CANIdentifier_CANPriority = 0;
#[doc = "< Priority highest - 1"]
pub const isobus_CANIdentifier_CANPriority_Priority1: isobus_CANIdentifier_CANPriority = 1;
#[doc = "< Priority highest - 2"]
pub const isobus_CANIdentifier_CANPriority_Priority2: isobus_CANIdentifier_CANPriority = 2;
#[doc = "< Priority highest - 3 (Control messages priority)"]
pub const isobus_CANIdentifier_CANPriority_Priority3: isobus_CANIdentifier_CANPriority = 3;
#[doc = "< Priority highest - 4"]
pub const isobus_CANIdentifier_CANPriority_Priority4: isobus_CANIdentifier_CANPriority = 4;
#[doc = "< Priority highest - 5"]
pub const isobus_CANIdentifier_CANPriority_Priority5: isobus_CANIdentifier_CANPriority = 5;
#[doc = "< The default priority"]
pub const isobus_CANIdentifier_CANPriority_PriorityDefault6: isobus_CANIdentifier_CANPriority = 6;
#[doc = "< The lowest priority"]
pub const isobus_CANIdentifier_CANPriority_PriorityLowest7: isobus_CANIdentifier_CANPriority = 7;
#[doc = " @brief Defines all the CAN frame priorities that can be encoded in a frame ID"]
pub type isobus_CANIdentifier_CANPriority = ::std::os::raw::c_uint;
#[doc = "< Frame is an 11bit ID standard (legacy) message with no PGN and highest priority"]
pub const isobus_CANIdentifier_Type_Standard: isobus_CANIdentifier_Type = 0;
#[doc = "< Frame is a modern 29 bit ID CAN frame"]
pub const isobus_CANIdentifier_Type_Extended: isobus_CANIdentifier_Type = 1;
#[doc = " @brief Defines if a frame is a standard (11 bit) or extended (29 bit) ID frame"]
pub type isobus_CANIdentifier_Type = ::std::os::raw::c_uint;
#[doc = "< This bit denotes if the frame is standard or extended format"]
pub const isobus_CANIdentifier_IDENTIFIER_TYPE_BIT_MASK: u32 = 2147483648;
#[doc = "< A fake PGN used internally to denote a NULL PGN"]
pub const isobus_CANIdentifier_UNDEFINED_PARAMETER_GROUP_NUMBER: u32 = 4294967295;
#[doc = "< The broadcast CAN address"]
pub const isobus_CANIdentifier_GLOBAL_ADDRESS: u8 = 255;
#[doc = "< The NULL CAN address as defined by ISO11783"]
pub const isobus_CANIdentifier_NULL_ADDRESS: u8 = 254;
#[doc = "< Broadcast PGNs don't mask off the bits used for destination in the PGN"]
pub const isobus_CANIdentifier_BROADCAST_PGN_MASK: u32 = 262143;
#[doc = "< Destination specific PGNs mask the destination out of the PGN itself"]
pub const isobus_CANIdentifier_DESTINATION_SPECIFIC_PGN_MASK: u32 = 261888;
#[doc = "< Mask that denotes the ID as being PDU2 format"]
pub const isobus_CANIdentifier_PDU2_FORMAT_MASK: u32 = 15728640;
#[doc = "< PGN is offset 8 bits into the ID"]
pub const isobus_CANIdentifier_PARAMTER_GROUP_NUMBER_OFFSET: u8 = 8;
#[doc = "< Priority is offset 26 bits into the ID"]
pub const isobus_CANIdentifier_PRIORITY_DATA_BIT_OFFSET: u8 = 26;
#[test]
fn bindgen_test_layout_isobus_CANIdentifier() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_CANIdentifier> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_CANIdentifier>(),
        4usize,
        concat!("Size of: ", stringify!(isobus_CANIdentifier))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_CANIdentifier>(),
        4usize,
        concat!("Alignment of ", stringify!(isobus_CANIdentifier))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_RawIdentifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANIdentifier),
            "::",
            stringify!(m_RawIdentifier)
        )
    );
}
extern "C" {
    #[doc = " @brief Returns the raw encoded ID of the CAN identifier\n @returns The raw encoded ID of the CAN identifier"]
    #[link_name = "\u{1}_ZNK6isobus13CANIdentifier14get_identifierEv"]
    pub fn isobus_CANIdentifier_get_identifier(this: *const isobus_CANIdentifier) -> u32;
}
extern "C" {
    #[doc = " @brief Returns the identifier type (standard vs extended)\n @returns The identifier type (standard vs extended)"]
    #[link_name = "\u{1}_ZNK6isobus13CANIdentifier19get_identifier_typeEv"]
    pub fn isobus_CANIdentifier_get_identifier_type(
        this: *const isobus_CANIdentifier,
    ) -> isobus_CANIdentifier_Type;
}
extern "C" {
    #[doc = " @brief Returns the PGN encoded in the identifier\n @returns The PGN encoded in the identifier"]
    #[link_name = "\u{1}_ZNK6isobus13CANIdentifier26get_parameter_group_numberEv"]
    pub fn isobus_CANIdentifier_get_parameter_group_number(
        this: *const isobus_CANIdentifier,
    ) -> u32;
}
extern "C" {
    #[doc = " @brief Returns the priority of the frame encoded in the identifier\n @returns The priority of the frame encoded in the identifier"]
    #[link_name = "\u{1}_ZNK6isobus13CANIdentifier12get_priorityEv"]
    pub fn isobus_CANIdentifier_get_priority(
        this: *const isobus_CANIdentifier,
    ) -> isobus_CANIdentifier_CANPriority;
}
extern "C" {
    #[doc = " @brief Returns the destination address of the frame encoded in the identifier\n @returns The destination address of the frame encoded in the identifier"]
    #[link_name = "\u{1}_ZNK6isobus13CANIdentifier23get_destination_addressEv"]
    pub fn isobus_CANIdentifier_get_destination_address(this: *const isobus_CANIdentifier) -> u8;
}
extern "C" {
    #[doc = " @brief Returns the source address of the frame encoded in the identifier\n @returns The source address of the frame encoded in the identifier"]
    #[link_name = "\u{1}_ZNK6isobus13CANIdentifier18get_source_addressEv"]
    pub fn isobus_CANIdentifier_get_source_address(this: *const isobus_CANIdentifier) -> u8;
}
extern "C" {
    #[doc = " @brief Returns if the ID is valid based on some range checking\n @returns Frame valid status"]
    #[link_name = "\u{1}_ZNK6isobus13CANIdentifier12get_is_validEv"]
    pub fn isobus_CANIdentifier_get_is_valid(this: *const isobus_CANIdentifier) -> bool;
}
extern "C" {
    #[doc = " @brief Constructor for a CAN Identifier class based on a raw 32 bit ID\n @param[in] rawIdentifierData The raw 32 bit ID to interpret"]
    #[link_name = "\u{1}_ZN6isobus13CANIdentifierC1Ej"]
    pub fn isobus_CANIdentifier_CANIdentifier(
        this: *mut isobus_CANIdentifier,
        rawIdentifierData: u32,
    );
}
extern "C" {
    #[doc = " @brief Constructor for a CAN Identifier class based on all discrete components\n @param[in] identifierType Type of frame, either standard 11 bit ID, or extended 29 bit ID\n @param[in] pgn The parameter group number encoded in the frame (extended only)\n @param[in] priority The priority of the frame (extended only)\n @param[in] destinationAddress The destination address of the frame\n @param[in] sourceAddress The source address of the frame"]
    #[link_name = "\u{1}_ZN6isobus13CANIdentifierC1ENS0_4TypeEjNS0_11CANPriorityEhh"]
    pub fn isobus_CANIdentifier_CANIdentifier1(
        this: *mut isobus_CANIdentifier,
        identifierType: isobus_CANIdentifier_Type,
        pgn: u32,
        priority: isobus_CANIdentifier_CANPriority,
        destinationAddress: u8,
        sourceAddress: u8,
    );
}
extern "C" {
    #[doc = " @brief Copy constructor for a CAN Identifier\n @param[in] copiedObject The object to copy"]
    #[link_name = "\u{1}_ZN6isobus13CANIdentifierC1ERKS0_"]
    pub fn isobus_CANIdentifier_CANIdentifier2(
        this: *mut isobus_CANIdentifier,
        copiedObject: *const isobus_CANIdentifier,
    );
}
extern "C" {
    #[doc = " @brief Destructor for the CANIdentifier"]
    #[link_name = "\u{1}_ZN6isobus13CANIdentifierD1Ev"]
    pub fn isobus_CANIdentifier_CANIdentifier_destructor(this: *mut isobus_CANIdentifier);
}
impl isobus_CANIdentifier {
    #[inline]
    pub unsafe fn get_identifier(&self) -> u32 {
        isobus_CANIdentifier_get_identifier(self)
    }
    #[inline]
    pub unsafe fn get_identifier_type(&self) -> isobus_CANIdentifier_Type {
        isobus_CANIdentifier_get_identifier_type(self)
    }
    #[inline]
    pub unsafe fn get_parameter_group_number(&self) -> u32 {
        isobus_CANIdentifier_get_parameter_group_number(self)
    }
    #[inline]
    pub unsafe fn get_priority(&self) -> isobus_CANIdentifier_CANPriority {
        isobus_CANIdentifier_get_priority(self)
    }
    #[inline]
    pub unsafe fn get_destination_address(&self) -> u8 {
        isobus_CANIdentifier_get_destination_address(self)
    }
    #[inline]
    pub unsafe fn get_source_address(&self) -> u8 {
        isobus_CANIdentifier_get_source_address(self)
    }
    #[inline]
    pub unsafe fn get_is_valid(&self) -> bool {
        isobus_CANIdentifier_get_is_valid(self)
    }
    #[inline]
    pub unsafe fn new(rawIdentifierData: u32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_CANIdentifier_CANIdentifier(__bindgen_tmp.as_mut_ptr(), rawIdentifierData);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        identifierType: isobus_CANIdentifier_Type,
        pgn: u32,
        priority: isobus_CANIdentifier_CANPriority,
        destinationAddress: u8,
        sourceAddress: u8,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_CANIdentifier_CANIdentifier1(
            __bindgen_tmp.as_mut_ptr(),
            identifierType,
            pgn,
            priority,
            destinationAddress,
            sourceAddress,
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(copiedObject: *const isobus_CANIdentifier) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_CANIdentifier_CANIdentifier2(__bindgen_tmp.as_mut_ptr(), copiedObject);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        isobus_CANIdentifier_CANIdentifier_destructor(self)
    }
}
#[repr(C)]
pub struct isobus_CANMessage__bindgen_vtable(::std::os::raw::c_void);
#[doc = " @class CANMessage\n\n @brief A class that represents a generic CAN message of arbitrary length."]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_CANMessage {
    pub vtable_: *const isobus_CANMessage__bindgen_vtable,
    #[doc = "< A data buffer for the message, used when not using data chunk callbacks"]
    pub data: [u64; 3usize],
    #[doc = "< The source control function of the message"]
    pub source: *mut isobus_ControlFunction,
    #[doc = "< The destination control function of the message"]
    pub destination: *mut isobus_ControlFunction,
    #[doc = "< The CAN ID of the message"]
    pub identifier: isobus_CANIdentifier,
    #[doc = "< The internal message type associated with the message"]
    pub messageType: isobus_CANMessage_Type,
    #[doc = "< The unique ID of the message, an internal value for tracking and stats"]
    pub messageUniqueID: u32,
    #[doc = "< The CAN channel index associated with the message"]
    pub CANPortIndex: u8,
}
#[doc = "< Message is to be transmitted from the stack"]
pub const isobus_CANMessage_Type_Transmit: isobus_CANMessage_Type = 0;
#[doc = "< Message is being received"]
pub const isobus_CANMessage_Type_Receive: isobus_CANMessage_Type = 1;
#[doc = "< Message is being used internally as data storage for a protocol"]
pub const isobus_CANMessage_Type_Internal: isobus_CANMessage_Type = 2;
#[doc = " @brief The internal message type"]
pub type isobus_CANMessage_Type = ::std::os::raw::c_int;
#[doc = " @brief ISO11783-3 defines this: The maximum number of packets that can be sent in a single connection\n with extended transport protocol is restricted by the extended data packet offset (3 bytes).\n This yields a maximum message size of (2^24-1 packets) x (7 bytes/packet) = 117440505 bytes\n @returns The maximum length of any CAN message as defined by ETP in ISO11783"]
pub const isobus_CANMessage_ABSOLUTE_MAX_MESSAGE_LENGTH: u32 = 117440505;
extern "C" {
    #[doc = "< A unique, sequential ID for this CAN message"]
    #[link_name = "\u{1}_ZN6isobus10CANMessage21lastGeneratedUniqueIDE"]
    pub static mut isobus_CANMessage_lastGeneratedUniqueID: u32;
}
#[test]
fn bindgen_test_layout_isobus_CANMessage() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_CANMessage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_CANMessage>(),
        64usize,
        concat!("Size of: ", stringify!(isobus_CANMessage))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_CANMessage>(),
        8usize,
        concat!("Alignment of ", stringify!(isobus_CANMessage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANMessage),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).source) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANMessage),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destination) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANMessage),
            "::",
            stringify!(destination)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).identifier) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANMessage),
            "::",
            stringify!(identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).messageType) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANMessage),
            "::",
            stringify!(messageType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).messageUniqueID) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANMessage),
            "::",
            stringify!(messageUniqueID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CANPortIndex) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANMessage),
            "::",
            stringify!(CANPortIndex)
        )
    );
}
extern "C" {
    #[doc = " @brief Returns the CAN message type\n @returns The type of the CAN message"]
    #[link_name = "\u{1}_ZNK6isobus10CANMessage8get_typeEv"]
    pub fn isobus_CANMessage_get_type(this: *const isobus_CANMessage) -> isobus_CANMessage_Type;
}
extern "C" {
    #[doc = " @brief Gets a reference to the data in the CAN message\n @returns A reference to the data in the CAN message"]
    #[link_name = "\u{1}_ZN6isobus10CANMessage8get_dataEv"]
    // pub fn isobus_CANMessage_get_data(this: *mut isobus_CANMessage) -> *mut [u64; 3usize];
    pub fn isobus_CANMessage_get_data(this: *mut isobus_CANMessage) -> *mut [u8];
}
extern "C" {
    #[doc = " @brief Gets the source control function that the message is from\n @returns The source control function that the message is from"]
    #[link_name = "\u{1}_ZNK6isobus10CANMessage27get_source_control_functionEv"]
    pub fn isobus_CANMessage_get_source_control_function(
        this: *const isobus_CANMessage,
    ) -> *mut isobus_ControlFunction;
}
extern "C" {
    #[doc = " @brief Gets the destination control function that the message is to\n @returns The destination control function that the message is to"]
    #[link_name = "\u{1}_ZNK6isobus10CANMessage32get_destination_control_functionEv"]
    pub fn isobus_CANMessage_get_destination_control_function(
        this: *const isobus_CANMessage,
    ) -> *mut isobus_ControlFunction;
}
extern "C" {
    #[doc = " @brief Returns the identifier of the message\n @returns The identifier of the message"]
    #[link_name = "\u{1}_ZNK6isobus10CANMessage14get_identifierEv"]
    pub fn isobus_CANMessage_get_identifier(this: *const isobus_CANMessage)
        -> isobus_CANIdentifier;
}
extern "C" {
    #[doc = " @brief Returns the unique message ID\n @returns The unique message ID"]
    #[link_name = "\u{1}_ZNK6isobus10CANMessage21get_message_unique_idEv"]
    pub fn isobus_CANMessage_get_message_unique_id(this: *const isobus_CANMessage) -> u32;
}
extern "C" {
    #[doc = " @brief Returns the CAN channel index associated with the message\n @returns The CAN channel index associated with the message"]
    #[link_name = "\u{1}_ZNK6isobus10CANMessage18get_can_port_indexEv"]
    pub fn isobus_CANMessage_get_can_port_index(this: *const isobus_CANMessage) -> u8;
}
extern "C" {
    #[doc = " @brief Constructor for a CAN message\n @param[in] CANPort The can channel index the message uses"]
    #[link_name = "\u{1}_ZN6isobus10CANMessageC1Eh"]
    pub fn isobus_CANMessage_CANMessage(this: *mut isobus_CANMessage, CANPort: u8);
}
impl isobus_CANMessage {
    #[inline]
    pub unsafe fn get_type(&self) -> isobus_CANMessage_Type {
        isobus_CANMessage_get_type(self)
    }
    #[inline]
    pub unsafe fn get_data(&mut self) -> *mut [u8] {
        isobus_CANMessage_get_data(self)
    }
    #[inline]
    pub unsafe fn get_source_control_function(&self) -> *mut isobus_ControlFunction {
        isobus_CANMessage_get_source_control_function(self)
    }
    #[inline]
    pub unsafe fn get_destination_control_function(&self) -> *mut isobus_ControlFunction {
        isobus_CANMessage_get_destination_control_function(self)
    }
    #[inline]
    pub unsafe fn get_identifier(&self) -> isobus_CANIdentifier {
        isobus_CANMessage_get_identifier(self)
    }
    #[inline]
    pub unsafe fn get_message_unique_id(&self) -> u32 {
        isobus_CANMessage_get_message_unique_id(self)
    }
    #[inline]
    pub unsafe fn get_can_port_index(&self) -> u8 {
        isobus_CANMessage_get_can_port_index(self)
    }
    #[inline]
    pub unsafe fn new(CANPort: u8) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_CANMessage_CANMessage(__bindgen_tmp.as_mut_ptr(), CANPort);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[doc = " @brief Returns the length of the data in the CAN message\n @returns The message data payload length"]
    #[link_name = "\u{1}_ZNK6isobus10CANMessage15get_data_lengthEv"]
    pub fn isobus_CANMessage_get_data_length(this: *mut ::std::os::raw::c_void) -> u32;
}
#[doc = "< \"ACK\" Indicates that the request was completed"]
pub const isobus_AcknowledgementType_Positive: isobus_AcknowledgementType = 0;
#[doc = "< \"NACK\" Indicates the request was not completed or we do not support the PGN"]
pub const isobus_AcknowledgementType_Negative: isobus_AcknowledgementType = 1;
#[doc = "< Signals to the requestor that their CF is not allowed to request this PGN"]
pub const isobus_AcknowledgementType_AccessDenied: isobus_AcknowledgementType = 2;
#[doc = "< Signals to the requestor that we are unable to accept the request for some reason"]
pub const isobus_AcknowledgementType_CannotRespond: isobus_AcknowledgementType = 3;
#[doc = " @brief The types of acknowldegement that can be sent in the Ack PGN"]
pub type isobus_AcknowledgementType = u8;
#[doc = " @brief A callback for control functions to get CAN messages"]
pub type isobus_CANLibCallback = ::std::option::Option<
    unsafe extern "C" fn(
        message: *mut isobus_CANMessage,
        parentPointer: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @brief A callback to get chunks of data for transfer by a protocol"]
pub type isobus_DataChunkCallback = ::std::option::Option<
    unsafe extern "C" fn(
        callbackIndex: u32,
        bytesOffset: u32,
        numberOfBytesNeeded: u32,
        chunkBuffer: *mut u8,
        parentPointer: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
#[doc = " @brief A callback for when a transmit is completed by the stack"]
pub type isobus_TransmitCompleteCallback = ::std::option::Option<
    unsafe extern "C" fn(
        parameterGroupNumber: u32,
        dataLength: u32,
        sourceControlFunction: *mut isobus_InternalControlFunction,
        destinationControlFunction: *mut isobus_ControlFunction,
        successful: bool,
        parentPointer: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @brief A callback for handling a PGN request"]
pub type isobus_PGNRequestCallback = ::std::option::Option<
    unsafe extern "C" fn(
        parameterGroupNumber: u32,
        requestingControlFunction: *mut isobus_ControlFunction,
        acknowledge: *mut bool,
        acknowledgeType: *mut isobus_AcknowledgementType,
        parentPointer: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
#[doc = " @brief A callback for handling a request for repetition rate for a specific PGN"]
pub type isobus_PGNRequestForRepetitionRateCallback = ::std::option::Option<
    unsafe extern "C" fn(
        parameterGroupNumber: u32,
        requestingControlFunction: *mut isobus_ControlFunction,
        repetitionRate: u32,
        parentPointer: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
#[doc = " @class ParameterGroupNumberCallbackData\n\n @brief A storage class to hold data about PGN callbacks."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct isobus_ParameterGroupNumberCallbackData {
    #[doc = "< The callback that will get called when a matching PGN is received"]
    pub mCallback: isobus_CANLibCallback,
    #[doc = "< The PGN assocuiated with this callback"]
    pub mParameterGroupNumber: u32,
    #[doc = "< A generic variable that can provide context to which object the callback was meant for"]
    pub mParent: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_isobus_ParameterGroupNumberCallbackData() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_ParameterGroupNumberCallbackData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_ParameterGroupNumberCallbackData>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(isobus_ParameterGroupNumberCallbackData)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_ParameterGroupNumberCallbackData>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(isobus_ParameterGroupNumberCallbackData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mCallback) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ParameterGroupNumberCallbackData),
            "::",
            stringify!(mCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mParameterGroupNumber) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ParameterGroupNumberCallbackData),
            "::",
            stringify!(mParameterGroupNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mParent) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ParameterGroupNumberCallbackData),
            "::",
            stringify!(mParent)
        )
    );
}
extern "C" {
    #[doc = " @brief Returns the PGN associated with this callback data\n @returns The PGN associated with this callback data"]
    #[link_name = "\u{1}_ZNK6isobus32ParameterGroupNumberCallbackData26get_parameter_group_numberEv"]
    pub fn isobus_ParameterGroupNumberCallbackData_get_parameter_group_number(
        this: *const isobus_ParameterGroupNumberCallbackData,
    ) -> u32;
}
extern "C" {
    #[doc = " @brief Returns the callback pointer for this data object\n @returns The callback pointer for this data object"]
    #[link_name = "\u{1}_ZNK6isobus32ParameterGroupNumberCallbackData12get_callbackEv"]
    pub fn isobus_ParameterGroupNumberCallbackData_get_callback(
        this: *const isobus_ParameterGroupNumberCallbackData,
    ) -> isobus_CANLibCallback;
}
extern "C" {
    #[doc = " @brief Returns the parent pointer for this data object"]
    #[link_name = "\u{1}_ZNK6isobus32ParameterGroupNumberCallbackData10get_parentEv"]
    pub fn isobus_ParameterGroupNumberCallbackData_get_parent(
        this: *const isobus_ParameterGroupNumberCallbackData,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " @brief A constructor for holding callback data\n @param[in] parameterGroupNumber The PGN you want to register a callback for\n @param[in] callback The function you want the stack to call when it gets receives a message with a matching PGN\n @param[in] parentPointer A generic variable that can provide context to which object the callback was meant for"]
    #[link_name = "\u{1}_ZN6isobus32ParameterGroupNumberCallbackDataC1EjPFvPNS_10CANMessageEPvES3_"]
    pub fn isobus_ParameterGroupNumberCallbackData_ParameterGroupNumberCallbackData(
        this: *mut isobus_ParameterGroupNumberCallbackData,
        parameterGroupNumber: u32,
        callback: isobus_CANLibCallback,
        parentPointer: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " @brief A copy constructor for holding callback data\n @param[in] oldObj The object to copy from"]
    #[link_name = "\u{1}_ZN6isobus32ParameterGroupNumberCallbackDataC1ERKS0_"]
    pub fn isobus_ParameterGroupNumberCallbackData_ParameterGroupNumberCallbackData1(
        this: *mut isobus_ParameterGroupNumberCallbackData,
        oldObj: *const isobus_ParameterGroupNumberCallbackData,
    );
}
impl isobus_ParameterGroupNumberCallbackData {
    #[inline]
    pub unsafe fn get_parameter_group_number(&self) -> u32 {
        isobus_ParameterGroupNumberCallbackData_get_parameter_group_number(self)
    }
    #[inline]
    pub unsafe fn get_callback(&self) -> isobus_CANLibCallback {
        isobus_ParameterGroupNumberCallbackData_get_callback(self)
    }
    #[inline]
    pub unsafe fn get_parent(&self) -> *mut ::std::os::raw::c_void {
        isobus_ParameterGroupNumberCallbackData_get_parent(self)
    }
    #[inline]
    pub unsafe fn new(
        parameterGroupNumber: u32,
        callback: isobus_CANLibCallback,
        parentPointer: *mut ::std::os::raw::c_void,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_ParameterGroupNumberCallbackData_ParameterGroupNumberCallbackData(
            __bindgen_tmp.as_mut_ptr(),
            parameterGroupNumber,
            callback,
            parentPointer,
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(oldObj: *const isobus_ParameterGroupNumberCallbackData) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_ParameterGroupNumberCallbackData_ParameterGroupNumberCallbackData1(
            __bindgen_tmp.as_mut_ptr(),
            oldObj,
        );
        __bindgen_tmp.assume_init()
    }
}
#[doc = "< An invalid NAME used as a default"]
pub const isobus_DEFAULT_NAME: u64 = 18446744073709551615;
#[doc = "< An invalid identifier used as a default"]
pub const isobus_DEFAULT_IDENTIFIER: u32 = 4294967295;
#[doc = "< The NULL CAN address defined by J1939 and ISO11783"]
pub const isobus_NULL_CAN_ADDRESS: u8 = 254;
#[doc = "< The global/broadcast CAN address"]
pub const isobus_BROADCAST_CAN_ADDRESS: u8 = 255;
#[doc = "< The length of a classical CAN frame"]
pub const isobus_CAN_DATA_LENGTH: u8 = 8;
#[doc = "< An arbitrary limit for memory consumption"]
pub const isobus_CAN_PORT_MAXIMUM: u32 = 4;
#[doc = " @class CANLibManagedMessage\n\n @brief A derived CAN message class that the stack can use to manipulate CAN message data\n in order to construct a message to send or track message details in a protocol class."]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_CANLibManagedMessage {
    pub _base: isobus_CANMessage,
    #[doc = "< The size of the message when using callbacks and not the internal data vector"]
    pub callbackMessageSize: u32,
}
#[test]
fn bindgen_test_layout_isobus_CANLibManagedMessage() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_CANLibManagedMessage> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_CANLibManagedMessage>(),
        72usize,
        concat!("Size of: ", stringify!(isobus_CANLibManagedMessage))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_CANLibManagedMessage>(),
        8usize,
        concat!("Alignment of ", stringify!(isobus_CANLibManagedMessage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callbackMessageSize) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANLibManagedMessage),
            "::",
            stringify!(callbackMessageSize)
        )
    );
}
extern "C" {
    #[doc = " @brief Sets the message data to the value supplied. Creates a copy.\n @param[in] dataBuffer The data payload\n @param[in] length the length of the data payload in bytes"]
    #[link_name = "\u{1}_ZN6isobus20CANLibManagedMessage8set_dataEPKhj"]
    pub fn isobus_CANLibManagedMessage_set_data(
        this: *mut isobus_CANLibManagedMessage,
        dataBuffer: *const u8,
        length: u32,
    );
}
extern "C" {
    #[doc = " @brief Sets one byte of data in the message data payload\n @param[in] dataByte One byte of data\n @param[in] insertPosition The position in the message at which to insert the data byte"]
    #[link_name = "\u{1}_ZN6isobus20CANLibManagedMessage8set_dataEhj"]
    pub fn isobus_CANLibManagedMessage_set_data1(
        this: *mut isobus_CANLibManagedMessage,
        dataByte: u8,
        insertPosition: u32,
    );
}
extern "C" {
    #[doc = " @brief Sets the size of the data payload\n @param[in] length The desired length of the data payload"]
    #[link_name = "\u{1}_ZN6isobus20CANLibManagedMessage13set_data_sizeEj"]
    pub fn isobus_CANLibManagedMessage_set_data_size(
        this: *mut isobus_CANLibManagedMessage,
        length: u32,
    );
}
extern "C" {
    #[doc = " @brief Sets the source control function for the message\n @param[in] value The source control function"]
    #[link_name = "\u{1}_ZN6isobus20CANLibManagedMessage27set_source_control_functionEPNS_15ControlFunctionE"]
    pub fn isobus_CANLibManagedMessage_set_source_control_function(
        this: *mut isobus_CANLibManagedMessage,
        value: *mut isobus_ControlFunction,
    );
}
extern "C" {
    #[doc = " @brief Sets the destination control function for the message\n @param[in] value The destination control function"]
    #[link_name = "\u{1}_ZN6isobus20CANLibManagedMessage32set_destination_control_functionEPNS_15ControlFunctionE"]
    pub fn isobus_CANLibManagedMessage_set_destination_control_function(
        this: *mut isobus_CANLibManagedMessage,
        value: *mut isobus_ControlFunction,
    );
}
extern "C" {
    #[doc = " @brief Sets the CAN ID of the message\n @param[in] value The CAN ID for the message"]
    #[link_name = "\u{1}_ZN6isobus20CANLibManagedMessage14set_identifierENS_13CANIdentifierE"]
    pub fn isobus_CANLibManagedMessage_set_identifier(
        this: *mut isobus_CANLibManagedMessage,
        value: isobus_CANIdentifier,
    );
}
extern "C" {
    #[doc = " @brief Gets the size of the message when using callbacks and not the internal data vector"]
    #[link_name = "\u{1}_ZNK6isobus20CANLibManagedMessage25get_callback_message_sizeEv"]
    pub fn isobus_CANLibManagedMessage_get_callback_message_size(
        this: *const isobus_CANLibManagedMessage,
    ) -> u32;
}
extern "C" {
    #[doc = " @brief Constructor for the CANLibManagedMessage\n @param[in] CANPort The can channel index the message uses"]
    #[link_name = "\u{1}_ZN6isobus20CANLibManagedMessageC1Eh"]
    pub fn isobus_CANLibManagedMessage_CANLibManagedMessage(
        this: *mut isobus_CANLibManagedMessage,
        CANPort: u8,
    );
}
impl isobus_CANLibManagedMessage {
    #[inline]
    pub unsafe fn set_data(&mut self, dataBuffer: *const u8, length: u32) {
        isobus_CANLibManagedMessage_set_data(self, dataBuffer, length)
    }
    #[inline]
    pub unsafe fn set_data1(&mut self, dataByte: u8, insertPosition: u32) {
        isobus_CANLibManagedMessage_set_data1(self, dataByte, insertPosition)
    }
    #[inline]
    pub unsafe fn set_data_size(&mut self, length: u32) {
        isobus_CANLibManagedMessage_set_data_size(self, length)
    }
    #[inline]
    pub unsafe fn set_source_control_function(&mut self, value: *mut isobus_ControlFunction) {
        isobus_CANLibManagedMessage_set_source_control_function(self, value)
    }
    #[inline]
    pub unsafe fn set_destination_control_function(&mut self, value: *mut isobus_ControlFunction) {
        isobus_CANLibManagedMessage_set_destination_control_function(self, value)
    }
    #[inline]
    pub unsafe fn set_identifier(&mut self, value: isobus_CANIdentifier) {
        isobus_CANLibManagedMessage_set_identifier(self, value)
    }
    #[inline]
    pub unsafe fn get_callback_message_size(&self) -> u32 {
        isobus_CANLibManagedMessage_get_callback_message_size(self)
    }
    #[inline]
    pub unsafe fn new(CANPort: u8) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_CANLibManagedMessage_CANLibManagedMessage(__bindgen_tmp.as_mut_ptr(), CANPort);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[doc = " @brief Gets the size of the data payload\n @returns The length of the data payload"]
    #[link_name = "\u{1}_ZNK6isobus20CANLibManagedMessage15get_data_lengthEv"]
    pub fn isobus_CANLibManagedMessage_get_data_length(this: *mut ::std::os::raw::c_void) -> u32;
}
#[repr(C)]
pub struct isobus_CANLibProtocol__bindgen_vtable(::std::os::raw::c_void);
#[doc = " @class CANLibProtocol\n\n @brief A base class for a CAN protocol\n @details CANLibProtocols are objects that manage different statful CAN protocols defined by\n ISO11783 and/or J1939. They could also be used for abitrary processing inside the CAN stack."]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_CANLibProtocol {
    pub vtable_: *const isobus_CANLibProtocol__bindgen_vtable,
    #[doc = "< Keeps track of if the protocol has been initialized by the network manager"]
    pub initialized: bool,
}
#[test]
fn bindgen_test_layout_isobus_CANLibProtocol() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_CANLibProtocol> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_CANLibProtocol>(),
        16usize,
        concat!("Size of: ", stringify!(isobus_CANLibProtocol))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_CANLibProtocol>(),
        8usize,
        concat!("Alignment of ", stringify!(isobus_CANLibProtocol))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialized) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_CANLibProtocol),
            "::",
            stringify!(initialized)
        )
    );
}
extern "C" {
    #[doc = " @brief Returns whether or not the protocol has been initialized by the network manager\n @returns true if the protocol has been initialized by the network manager"]
    #[link_name = "\u{1}_ZNK6isobus14CANLibProtocol18get_is_initializedEv"]
    pub fn isobus_CANLibProtocol_get_is_initialized(this: *const isobus_CANLibProtocol) -> bool;
}
extern "C" {
    #[doc = " @brief Gets a CAN protocol by index from the list of all protocols\n @param[in] index The index of the protocol to get from the list of protocols\n @param[out] returnedProtocol The returned protocol\n @returns true if a protocol was successfully returned, false if index was out of range"]
    #[link_name = "\u{1}_ZN6isobus14CANLibProtocol12get_protocolEjRPS0_"]
    pub fn isobus_CANLibProtocol_get_protocol(
        index: u32,
        returnedProtocol: *mut *mut isobus_CANLibProtocol,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Returns the number of all created protocols\n @returns The number of all created protocols"]
    #[link_name = "\u{1}_ZN6isobus14CANLibProtocol20get_number_protocolsEv"]
    pub fn isobus_CANLibProtocol_get_number_protocols() -> u32;
}
extern "C" {
    #[doc = " @brief The base class constructor for a CANLibProtocol"]
    #[link_name = "\u{1}_ZN6isobus14CANLibProtocolC2Ev"]
    pub fn isobus_CANLibProtocol_CANLibProtocol(this: *mut isobus_CANLibProtocol);
}
impl isobus_CANLibProtocol {
    #[inline]
    pub unsafe fn get_is_initialized(&self) -> bool {
        isobus_CANLibProtocol_get_is_initialized(self)
    }
    #[inline]
    pub unsafe fn get_protocol(
        index: u32,
        returnedProtocol: *mut *mut isobus_CANLibProtocol,
    ) -> bool {
        isobus_CANLibProtocol_get_protocol(index, returnedProtocol)
    }
    #[inline]
    pub unsafe fn get_number_protocols() -> u32 {
        isobus_CANLibProtocol_get_number_protocols()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_CANLibProtocol_CANLibProtocol(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[doc = " @brief The base class destructor for a CANLibProtocol"]
    #[link_name = "\u{1}_ZN6isobus14CANLibProtocolD1Ev"]
    pub fn isobus_CANLibProtocol_CANLibProtocol_destructor(this: *mut isobus_CANLibProtocol);
}
extern "C" {
    #[doc = " @brief A generic way to initialize a protocol\n @details The network manager will call a protocol's initialize function\n when it is first updated, if it has yet to be initialized."]
    #[link_name = "\u{1}_ZN6isobus14CANLibProtocol10initializeENS_11CANLibBadgeINS_17CANNetworkManagerEEE"]
    pub fn isobus_CANLibProtocol_initialize(
        this: *mut ::std::os::raw::c_void,
        arg1: isobus_CANLibBadge,
    );
}
#[doc = " @class ExtendedTransportProtocolManager\n\n @brief A class that handles the ISO11783 extended transport protocol.\n @details This class handles transmission and reception of CAN messages more than 1785 bytes.\n Simply call send_can_message on the network manager with an appropriate data length,\n and the protocol will be automatically selected to be used."]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_ExtendedTransportProtocolManager {
    pub _base: isobus_CANLibProtocol,
    #[doc = "< A list of all active TP sessions"]
    pub activeSessions: [u64; 3usize],
}
#[doc = "< Reserved, not to be used, but should be tolerated"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_Reserved:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 0;
#[doc = "< We are already in a session and can't support another"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_AlreadyInConnectionManagedSessionAndCannotSupportAnother : isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 1 ;
#[doc = "< Session must be aborted because the system needs resources"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_SystemResourcesNeededForAnotherTask : isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 2 ;
#[doc = "< General timeout"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_Timeout:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 3;
#[doc = "< A CTS was received while already processing the last CTS"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_ClearToSendReceivedWhenDataTransferInProgress : isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 4 ;
#[doc = "< Maxmimum retries for the data has been reached"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_MaximumRetransmitRequestLimitReached : isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 5 ;
#[doc = "< A data packet was received outside the proper state"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_UnexpectedDataTransferPacket : isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 6 ;
#[doc = "< Incorrect sequence number was received and cannot be recovered"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_BadSequenceNumber:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 7;
#[doc = "< Re-received a sequence number we've already processed"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_DuplicateSequenceNumber:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 8;
#[doc = "< EDPO Received in an invalid state"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_UnexpectedEDPOPacket:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 9;
#[doc = "< Unexpected PGN in received EDPO"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_UnexpectedEDPOPgn:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 10;
#[doc = "< Number of EDPO packets is > CTS"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_EDPONumberOfPacketsGreaterThanClearToSend : isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 11 ;
#[doc = "< EDPO offset was invalid"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_BadEDPOOffset:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 12;
#[doc = "< Don't use this. Use AnyOtherReason instead"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_DeprecatedReason:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 13;
#[doc = "< PGN in received ECTS doesn't match session"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_UnexpectedECTSPgn:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 14;
#[doc = "< ETP Can't support a message this large (CANMessage::ABSOLUTE_MAX_MESSAGE_LENGTH)"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_ECTSRequestedPacketsExceedsMessageSize : isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 15 ;
#[doc = "< Any other error not enumerated above, 0xFE"]
pub const isobus_ExtendedTransportProtocolManager_ConnectionAbortReason_AnyOtherReason:
    isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = 254;
#[doc = "  @brief A list of all defined abort reasons in ISO11783"]
pub type isobus_ExtendedTransportProtocolManager_ConnectionAbortReason = ::std::os::raw::c_int;
#[doc = "< Protocol session is not in progress"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_None:
    isobus_ExtendedTransportProtocolManager_StateMachineState = 0;
#[doc = "< We are sending the request to send message"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_RequestToSend:
    isobus_ExtendedTransportProtocolManager_StateMachineState = 1;
#[doc = "< We are waiting for a clear to send message"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_WaitForClearToSend:
    isobus_ExtendedTransportProtocolManager_StateMachineState = 2;
#[doc = "< We are receiving data packets"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_RxDataSession:
    isobus_ExtendedTransportProtocolManager_StateMachineState = 3;
#[doc = "< We are sending clear to send message"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_ClearToSend:
    isobus_ExtendedTransportProtocolManager_StateMachineState = 4;
#[doc = "< We are waiting for an EDPO message"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_WaitForExtendedDataPacketOffset : isobus_ExtendedTransportProtocolManager_StateMachineState = 5 ;
#[doc = "< We are transmitting EDPOs and data packets"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_TxDataSession:
    isobus_ExtendedTransportProtocolManager_StateMachineState = 6;
#[doc = "< We are waiting for an end of message acknowledgement"]
pub const isobus_ExtendedTransportProtocolManager_StateMachineState_WaitForEndOfMessageAcknowledge : isobus_ExtendedTransportProtocolManager_StateMachineState = 7 ;
#[doc = " @brief The states that a ETP session could be in. Used for the internal state machine."]
pub type isobus_ExtendedTransportProtocolManager_StateMachineState = ::std::os::raw::c_int;
#[doc = " @class ExtendedTransportProtocolSession\n\n @brief A storage object to keep track of session information internally"]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession {
    #[doc = "< The state machine state for this session"]
    pub state: isobus_ExtendedTransportProtocolManager_StateMachineState,
    #[doc = "< A CAN message is used in the session to represent and store data like PGN"]
    pub sessionMessage: isobus_CANLibManagedMessage,
    #[doc = "< A callback that is to be called when the session is completed"]
    pub sessionCompleteCallback: isobus_TransmitCompleteCallback,
    #[doc = "< A callback that might be used to get chunks of data to send"]
    pub frameChunkCallback: isobus_DataChunkCallback,
    #[doc = "< A generic context variable that helps identify what object callbacks are destined for. Can be nullptr"]
    pub parent: *mut ::std::os::raw::c_void,
    #[doc = "< A timestamp used to track session timeouts"]
    pub timestamp_ms: u32,
    #[doc = "< The last processed sequence number for this set of packets"]
    pub lastPacketNumber: u32,
    #[doc = "< The total number of packets to receive or send in this session"]
    pub packetCount: u32,
    #[doc = "< The total processed packet count for the whole session so far"]
    pub processedPacketsThisSession: u32,
    #[doc = "< Represents Tx or Rx session"]
    pub sessionDirection:
        isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession_Direction,
}
#[doc = "< We are transmitting a message"]
pub const isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession_Direction_Transmit : isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession_Direction = 0 ;
#[doc = "< We are receving a message"]
pub const isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession_Direction_Receive : isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession_Direction = 1 ;
#[doc = " @brief Enumerates the possible session directions, Rx or Tx"]
pub type isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession_Direction =
    ::std::os::raw::c_int;
#[test]
fn bindgen_test_layout_isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession() {
    const UNINIT: ::std::mem::MaybeUninit<
        isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<
            isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession,
        >(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<
            isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession,
        >(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sessionMessage) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(sessionMessage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sessionCompleteCallback) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(sessionCompleteCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameChunkCallback) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(frameChunkCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp_ms) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(timestamp_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastPacketNumber) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(lastPacketNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packetCount) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(packetCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).processedPacketsThisSession) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(processedPacketsThisSession)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sessionDirection) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolSession),
            "::",
            stringify!(sessionDirection)
        )
    );
}
#[doc = "< The max payload this protocol can support"]
pub const isobus_ExtendedTransportProtocolManager_MAX_PROTOCOL_DATA_LENGTH: u32 = 117440505;
#[doc = "< The min payload this protocol can support"]
pub const isobus_ExtendedTransportProtocolManager_MIN_PROTOCOL_DATA_LENGTH: u32 = 1786;
#[doc = "< The Tr timeout as defined by the standard"]
pub const isobus_ExtendedTransportProtocolManager_TR_TIMEOUT_MS: u32 = 200;
#[doc = "< The t1 timeout as defined by the standard"]
pub const isobus_ExtendedTransportProtocolManager_T1_TIMEOUT_MS: u32 = 750;
#[doc = "< The t2/t3 timeouts as defined by the standard"]
pub const isobus_ExtendedTransportProtocolManager_T2_3_TIMEOUT_MS: u32 = 1250;
#[doc = "< The Th timout as defined by the standard"]
pub const isobus_ExtendedTransportProtocolManager_TH_TIMEOUT_MS: u32 = 500;
#[doc = "< The multiplexor for the extended request to send message"]
pub const isobus_ExtendedTransportProtocolManager_EXTENDED_REQUEST_TO_SEND_MULTIPLEXOR: u8 = 20;
#[doc = "< The multiplexor for the extended clear to send message"]
pub const isobus_ExtendedTransportProtocolManager_EXTENDED_CLEAR_TO_SEND_MULTIPLEXOR: u8 = 21;
#[doc = "< The multiplexor for the extended data packet offset message"]
pub const isobus_ExtendedTransportProtocolManager_EXTENDED_DATA_PACKET_OFFSET_MULTIPLEXOR: u8 = 22;
#[doc = "< Multiplexor for the extended end of message acknowledgement message"]
pub const isobus_ExtendedTransportProtocolManager_EXTENDED_END_OF_MESSAGE_ACKNOWLEDGEMENT: u8 = 23;
#[doc = "< Multiplexor for the extended connection abort message"]
pub const isobus_ExtendedTransportProtocolManager_EXTENDED_CONNECTION_ABORT_MULTIPLEXOR: u8 = 255;
#[doc = "< The number of payload bytes per frame minus overhead of sequence number"]
pub const isobus_ExtendedTransportProtocolManager_PROTOCOL_BYTES_PER_FRAME: u8 = 7;
#[doc = "< The index of the sequence number in a frame"]
pub const isobus_ExtendedTransportProtocolManager_SEQUENCE_NUMBER_DATA_INDEX: u8 = 0;
#[test]
fn bindgen_test_layout_isobus_ExtendedTransportProtocolManager() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_ExtendedTransportProtocolManager> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_ExtendedTransportProtocolManager>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(isobus_ExtendedTransportProtocolManager)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_ExtendedTransportProtocolManager>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(isobus_ExtendedTransportProtocolManager)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).activeSessions) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_ExtendedTransportProtocolManager),
            "::",
            stringify!(activeSessions)
        )
    );
}
extern "C" {
    #[doc = " @brief A generic way for a protocol to process a received message\n @param[in] message A received CAN message\n @param[in] parent Provides the context to the actual TP manager object"]
    #[link_name = "\u{1}_ZN6isobus32ExtendedTransportProtocolManager15process_messageEPNS_10CANMessageEPv"]
    pub fn isobus_ExtendedTransportProtocolManager_process_message1(
        message: *mut isobus_CANMessage,
        parent: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " @brief The constructor for the TransportProtocolManager"]
    #[link_name = "\u{1}_ZN6isobus32ExtendedTransportProtocolManagerC1Ev"]
    pub fn isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolManager(
        this: *mut isobus_ExtendedTransportProtocolManager,
    );
}
impl isobus_ExtendedTransportProtocolManager {
    #[inline]
    pub unsafe fn process_message(
        message: *mut isobus_CANMessage,
        parent: *mut ::std::os::raw::c_void,
    ) {
        isobus_ExtendedTransportProtocolManager_process_message1(message, parent)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolManager(
            __bindgen_tmp.as_mut_ptr(),
        );
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[doc = " @brief The destructor for the TransportProtocolManager"]
    #[link_name = "\u{1}_ZN6isobus32ExtendedTransportProtocolManagerD1Ev"]
    pub fn isobus_ExtendedTransportProtocolManager_ExtendedTransportProtocolManager_destructor(
        this: *mut isobus_ExtendedTransportProtocolManager,
    );
}
extern "C" {
    #[doc = " @brief The protocol's initializer function"]
    #[link_name = "\u{1}_ZN6isobus32ExtendedTransportProtocolManager10initializeENS_11CANLibBadgeINS_17CANNetworkManagerEEE"]
    pub fn isobus_ExtendedTransportProtocolManager_initialize(
        this: *mut ::std::os::raw::c_void,
        arg1: isobus_CANLibBadge,
    );
}
extern "C" {
    #[doc = " @brief A generic way for a protocol to process a received message\n @param[in] message A received CAN message"]
    #[link_name = "\u{1}_ZN6isobus32ExtendedTransportProtocolManager15process_messageEPNS_10CANMessageE"]
    pub fn isobus_ExtendedTransportProtocolManager_process_message(
        this: *mut ::std::os::raw::c_void,
        message: *mut isobus_CANMessage,
    );
}
extern "C" {
    #[doc = " @brief The network manager calls this to see if the protocol can accept a long CAN message for processing\n @param[in] parameterGroupNumber The PGN of the message\n @param[in] data The data to be sent\n @param[in] messageLength The length of the data to be sent\n @param[in] source The source control function\n @param[in] destination The destination control function\n @param[in] transmitCompleteCallback A callback for when the protocol completes its work\n @param[in] parentPointer A generic context object for the tx complete and chunk callbacks\n @param[in] frameChunkCallback A callback to get some data to send\n @returns true if the message was accepted by the protocol for processing"]
    #[link_name = "\u{1}_ZN6isobus32ExtendedTransportProtocolManager25protocol_transmit_messageEjPKhjPNS_15ControlFunctionES4_PFvjjPNS_23InternalControlFunctionES4_bPvES7_PFbjjjPhS7_E"]
    pub fn isobus_ExtendedTransportProtocolManager_protocol_transmit_message(
        this: *mut ::std::os::raw::c_void,
        parameterGroupNumber: u32,
        data: *const u8,
        messageLength: u32,
        source: *mut isobus_ControlFunction,
        destination: *mut isobus_ControlFunction,
        transmitCompleteCallback: isobus_TransmitCompleteCallback,
        parentPointer: *mut ::std::os::raw::c_void,
        frameChunkCallback: isobus_DataChunkCallback,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Updates the protocol cyclically"]
    #[link_name = "\u{1}_ZN6isobus32ExtendedTransportProtocolManager6updateENS_11CANLibBadgeINS_17CANNetworkManagerEEE"]
    pub fn isobus_ExtendedTransportProtocolManager_update(
        this: *mut ::std::os::raw::c_void,
        arg1: isobus_CANLibBadge,
    );
}
#[doc = " @class HardwareInterfaceCANFrame\n\n @brief A CAN frame for interfacing with a hardware layer, like socket CAN or other interface"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct isobus_HardwareInterfaceCANFrame {
    #[doc = "< A microsecond timestamp"]
    pub timestamp_us: u64,
    #[doc = "< The 32 bit identifier of the frame"]
    pub identifier: u32,
    #[doc = "< The CAN channel index associated with the frame"]
    pub channel: u8,
    #[doc = "< The data payload of the frame"]
    pub data: [u8; 8usize],
    #[doc = "< The length of the data used in the frame"]
    pub dataLength: u8,
    #[doc = "< Denotes if the frame is extended format"]
    pub isExtendedFrame: bool,
}
#[test]
fn bindgen_test_layout_isobus_HardwareInterfaceCANFrame() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_HardwareInterfaceCANFrame> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_HardwareInterfaceCANFrame>(),
        24usize,
        concat!("Size of: ", stringify!(isobus_HardwareInterfaceCANFrame))
    );
    assert_eq!(
        ::std::mem::align_of::<isobus_HardwareInterfaceCANFrame>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(isobus_HardwareInterfaceCANFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp_us) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_HardwareInterfaceCANFrame),
            "::",
            stringify!(timestamp_us)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).identifier) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_HardwareInterfaceCANFrame),
            "::",
            stringify!(identifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_HardwareInterfaceCANFrame),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_HardwareInterfaceCANFrame),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataLength) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_HardwareInterfaceCANFrame),
            "::",
            stringify!(dataLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isExtendedFrame) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(isobus_HardwareInterfaceCANFrame),
            "::",
            stringify!(isExtendedFrame)
        )
    );
}
pub const isobus_CANLibParameterGroupNumber_Any: isobus_CANLibParameterGroupNumber = 0;
pub const isobus_CANLibParameterGroupNumber_DiagnosticMessage22: isobus_CANLibParameterGroupNumber =
    49920;
pub const isobus_CANLibParameterGroupNumber_ExtendedTransportProtocolDataTransfer:
    isobus_CANLibParameterGroupNumber = 50944;
pub const isobus_CANLibParameterGroupNumber_ExtendedTransportProtocolConnectionManagement:
    isobus_CANLibParameterGroupNumber = 51200;
pub const isobus_CANLibParameterGroupNumber_RequestForRepetitionRate:
    isobus_CANLibParameterGroupNumber = 52224;
pub const isobus_CANLibParameterGroupNumber_DiagnosticMessage13: isobus_CANLibParameterGroupNumber =
    57088;
pub const isobus_CANLibParameterGroupNumber_VirtualTerminalToECU:
    isobus_CANLibParameterGroupNumber = 58880;
pub const isobus_CANLibParameterGroupNumber_ECUtoVirtualTerminal:
    isobus_CANLibParameterGroupNumber = 59136;
pub const isobus_CANLibParameterGroupNumber_Acknowledge: isobus_CANLibParameterGroupNumber = 59392;
pub const isobus_CANLibParameterGroupNumber_ParameterGroupNumberRequest:
    isobus_CANLibParameterGroupNumber = 59904;
pub const isobus_CANLibParameterGroupNumber_TransportProtocolData:
    isobus_CANLibParameterGroupNumber = 60160;
pub const isobus_CANLibParameterGroupNumber_TransportProtocolCommand:
    isobus_CANLibParameterGroupNumber = 60416;
pub const isobus_CANLibParameterGroupNumber_AddressClaim: isobus_CANLibParameterGroupNumber = 60928;
pub const isobus_CANLibParameterGroupNumber_ProprietaryA: isobus_CANLibParameterGroupNumber = 61184;
pub const isobus_CANLibParameterGroupNumber_ProductIdentification:
    isobus_CANLibParameterGroupNumber = 64653;
pub const isobus_CANLibParameterGroupNumber_DiagnosticProtocolIdentification:
    isobus_CANLibParameterGroupNumber = 64818;
pub const isobus_CANLibParameterGroupNumber_WorkingSetMaster: isobus_CANLibParameterGroupNumber =
    65037;
pub const isobus_CANLibParameterGroupNumber_ECUIdentificationInformation:
    isobus_CANLibParameterGroupNumber = 64965;
pub const isobus_CANLibParameterGroupNumber_DiagnosticMessage1: isobus_CANLibParameterGroupNumber =
    65226;
pub const isobus_CANLibParameterGroupNumber_DiagnosticMessage2: isobus_CANLibParameterGroupNumber =
    65227;
pub const isobus_CANLibParameterGroupNumber_DiagnosticMessage3: isobus_CANLibParameterGroupNumber =
    65228;
pub const isobus_CANLibParameterGroupNumber_DiagnosticMessage11: isobus_CANLibParameterGroupNumber =
    65235;
pub const isobus_CANLibParameterGroupNumber_SoftwareIdentification:
    isobus_CANLibParameterGroupNumber = 65242;
#[doc = " @brief PGNs commonly used by the CAN stack"]
pub type isobus_CANLibParameterGroupNumber = ::std::os::raw::c_int;
extern "C" {
    #[doc = " @brief The abstraction layer between the hardware and the stack\n @param[in] frame The frame to transmit from the hardware"]
    #[link_name = "\u{1}_ZN6isobus28send_can_message_to_hardwareENS_25HardwareInterfaceCANFrameE"]
    pub fn isobus_send_can_message_to_hardware(frame: isobus_HardwareInterfaceCANFrame) -> bool;
}
#[doc = " @class InternalControlFunction\n\n @brief Describes an internal ECU's NAME and address data. Used to send CAN messages.\n @details This class is used to define your own ECU's NAME, and is used to transmit messages.\n Each instance of this class will claim a unique address on the bus, and can be used to\n send messages."]
#[repr(C)]
#[derive(Debug)]
pub struct isobus_InternalControlFunction {
    pub _base: isobus_ControlFunction,
    #[doc = "< The address claimer for this ICF"]
    pub stateMachine: isobus_AddressClaimStateMachine,
    #[doc = "< Tracks if this object has changed address since the last update"]
    pub objectChangedAddressSinceLastUpdate: bool,
}
extern "C" {
    #[doc = "< A list of all internal control functions that exist"]
    #[link_name = "\u{1}_ZN6isobus23InternalControlFunction27internalControlFunctionListE"]
    pub static mut isobus_InternalControlFunction_internalControlFunctionList: u8;
}
extern "C" {
    #[doc = "< Lets the network manager know if any ICF changed address since the last update"]
    #[link_name = "\u{1}_ZN6isobus23InternalControlFunction17anyChangedAddressE"]
    pub static mut isobus_InternalControlFunction_anyChangedAddress: bool;
}
#[test]
fn bindgen_test_layout_isobus_InternalControlFunction() {
    const UNINIT: ::std::mem::MaybeUninit<isobus_InternalControlFunction> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<isobus_InternalControlFunction>(),
        56usize,
